;ver. 1.0 del 26-02-2003
;INGLESE
;TESTI bit INPUT/OUTPUT - segnali di scambio

;*************************************************


;*************************************************

[LIST];IO Page List
0 = IO Pages
1 = UDX;Ecodox
2 = UC1;Uniclean
3 = UTH;Unitherm H
4 = UFA;Product Supplier
5 = ISO;Isolator
6 = SCR;Scrubber
7 = NTD;Terboven
8 = SH1;Sterilcap SH1
9 = CAP;CapsHopper
10 = _SB1;Sterilbag
11 = CIN;Infeed Conv
12 = COU;Outfeed Conv
13 = _SI2;Sterilcap IM2
14 = _CLR;Clean Room
15 = _BMM;Blower

;************************************************************************************************************
;************************************************************************************************************
;Testo sostitutivo del Commento in Lingua se la lunghezza della stringa eccede il limite max di 130 caratteri
[TXT]
0=>>>>>>>>>>>>>>>> Message too Long <<<<<<<<<<<<<<<<
;*************************************************

[SEA_1]
;SEALER
SX01 = B..SEALER
SX02 = D..ABFIL1.SignalFILFromSEA.Alarm..Alarm
SX03 = D..ABFIL1.SignalFILFromSEA.UnitReady..Unit Ready
SX04 = D..ABFIL1.SignalFILFromSEA.LackOfFoil..Lack Of Foil


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSEA.Start..Start
DX03 = D..ABFIL1.SignalFILToSEA.Stop..Stop


[UTH_1]
;UNITHERM
SX01 = B..UNITHERM
SX02 =D..ABUTH1.SignalUTHToFIL.CriticalAlarm..Critical Alarm (1=OK)
SX03 =
SX04 = D..ABUTH1.SignalUTHToFIL.FillerSterilStartEnable..Filler Sterilization Start Enable
SX05 = 
SX06 = D..ABUTH1.SignalUTHToFIL.SterilWaterReady..Sterile Water Ready                
SX07 = D..ABUTH1.SignalUTHToFIL.UhtStop..Unitherm In Stop (1=Stop)                       
SX08 = D..ABUTH1.SignalUTHToFIL.ReadyToCooling..Ready For Cooling                        
SX09 = D..ABUTH1.SignalUTHToFIL.SterilityLoss..Unitherm Loss Of Sterility         
SX10 = 
SX11 = D..ABUTH1.SignalUTHToFIL.ProdRinseWaterReady..Ready For Production Rinse
SX12 = D..ABUTH1.SignalUTHToFIL.UhtSterile..Unitherm in Sterile Condition
SX13 = D..ABUTH1.SignalUTHToFIL.ProdSterilRunning..Unitherm Resterilization in Production
SX14 = D..ABUTH1.SignalUTHToFIL.SteBarrSterCycle_BypassValve_ON..Steam Barr Ster.Cycle Bypass Valve On
SX15 = D..ABUTH1.SignalUTHToFIL.SteamForBarrierReq..Steam for Barrier Request
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = D..ABUTH1.SignalUTHToFIL.VPW09_FIL_SideFlowDone..VPW09 Filler Side Seat Flow Done
SX21 = D..ABUTH1.SignalUTHToFIL.VPW10_FIL_SideFlowDone..VPW10 Filler Side Seat Flow Done
SX22 = 
SX23 =
SX24 = D..ABUTH1.SignalUTHToFIL.SteBarrSterCycle_4WayValveSterile..Steam Barr Ster. Cycle 4Way Valve Sterile
SX25 = 
SX26 =D..ABUTH1.SignalUTHToFIL.RemoteControlEnable..Remote Control Enable
SX27 = D..ABUTH1.SignalUTHToFIL.RinserWaterRecoveryEnable..Rinser Water Recovery Enable 
SX28 = 



DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToPRO.UTH.CriticalAlarm..Critical Alarm (1=OK)
DX03 = D..ABFIL1.SignalFILToPRO.UTH.FillerInProduction..Filler in Production
DX04 = 
DX05 = 
DX06 =D..ABFIL1.SignalFILToPRO.UTH.SterilWaterReq..Sterile Water Request
DX07 =
DX08 = D..ABFIL1.SignalFILToPRO.UTH.FillerCoolingReq..Filler Cooling Request
DX09 = D..ABFIL1.SignalFILToPRO.UTH.UTHCoolingReq..Unitherm Cooling Request
DX10 = 
DX11 = D..ABFIL1.SignalFILToPRO.UTH.FillerCoolingStBy..Filler Cooling StandBy
DX12 = D..ABFIL1.SignalFILToPRO.UTH.WarmUpTo90C..Warm Up To 90°C Request
DX13 = D..ABFIL1.SignalFILToPRO.UTH.WarmUpToFXPartCool..Warm Up Cool Filler FX
DX14 = 
DX15 = 
DX16 = D..ABFIL1.SignalFILToPRO.UTH.ProductionRinse..Filler Rinse Request
DX17 =   
DX18 = D..ABFIL1.SignalFILToPRO.UTH.DemiWaterAvailable..Demi Water Available 
DX19 = D..ABFIL1.SignalFILToPRO.UTH.ProductionRinseCloseVPW09..VPW09 Closed (Filler Rinse Request)
DX20 = D..ABFIL1.SignalFILToPRO.UTH.VPW09_FIL_SideFlowReq..VPW09 Filler Side Flow Request
DX21 = D..ABFIL1.SignalFILToPRO.UTH.VPW10_FIL_SideFlowReq..VPW10 Filler Side Flow Request
DX22 = 
DX23 = 
DX24 = D..ABFIL1.SignalFILToPRO.UTH.UTHSipReq..Uht Resterilization Request 
DX25 = 
DX26 = 
DX27 = 
DX28 = 
 


[UTH_2]
;UNITHERM
SX01 = B..UNITHERM
SX02 = 
SX03 = 
SX04 = D..ABUTH1.SignalUTHToFIL.SterilityLoss..Loss of Sterility 
SX05 = 
SX06 = 
SX07 = 
SX08 =
SX09 =       
SX10 = D..ABUTH1.SignalUTHToFIL.AcidReq..Acid Request
SX11 =D..ABUTH1.SignalUTHToFIL.CausticReq..Caustic Request
SX12 = 
SX13 = D..ABUTH1.SignalUTHToFIL.SteritankRinseWaterReady..Steril Tank Rinse Water Ready
SX14 =D..ABUTH1.SignalUTHToFIL.SteritankSteamBarrierReq..Steril Tank Steam Barrier Request
SX15 = 
SX16 = 
SX17 =
SX18 = 
SX19 =
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = D..ABUTH1.SignalUTHToFIL.SteamHighPressureRequest..Steam High Pressure Request
SX28 = 


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToPRO.UTH.SteamAvailable..Steam Available                
DX03 = D..ABFIL1.SignalFILToPRO.UTH.SteamBarrierOpenReq..Steam Barrier Open Request 
DX04 = D..ABFIL1.SignalFILToPRO.UTH.HAEnable..High Acid Production       
DX05 = D..ABFIL1.SignalFILToPRO.UTH.LAEnable..Low Acid Production  
DX06 = D..ABFIL1.SignalFILToPRO.UTH.RecoveryWaterAvailable..Recovery Water Available   
DX07 = D..ABFIL1.SignalFILToPRO.UTH.UpsPowerOk..Ups Power Ok                       
DX08 = D..ABFIL1.SignalFILToPRO.UTH.UpsBatteryOk..Ups Battery Ok                  
DX09 = D..ABFIL1.SignalFILToPRO.UTH.CoolingESLFillerFx..Cooling ESL Filler Fx     
DX10 = D..ABFIL1.SignalFILToPRO.UTH.AcidAvailable.. Acid Available      
DX11 = D..ABFIL1.SignalFILToPRO.UTH.CausticAvailable.. Caustic Available 
DX12 = D..ABFIL1.SignalFILToPRO.UTH.SteBarrSterCycle_BypassSterLost..Ster. Cycle Ster Loss ByPass Valve 
DX13 = D..ABFIL1.SignalFILToPRO.UTH.SteBarrSterCycle_BypassValve_ONConf..Ster Cycle Barrier ByPass Valve on confirm
DX14 = D..ABFIL1.SignalFILToPRO.UTH.TestWithWater..Test With Water
DX15 = 
DX16 =
DX17 =
DX18 =
DX19 =
DX20 = 
DX21 = 
DX22 = 
DX23 =
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 



[UTH_3]
;UNICLEAN
SX01 = B..CLEAN
SX02 = D..ABUTH1.SignalCLEToFIL.CausticRequest..CLE -CausticRequest
SX03 = D..ABUTH1.SignalCLEToFIL.AcidRequest..CLE -AcidRequest
SX04 = 
SX05 = D..ABUTH1.SignalCLEToFIL.L1.CriticalAlarm..CLE L1-Critical Alarm
SX06 = 
SX07 = D..ABUTH1.SignalCLEToFIL.L1.ProductChangeOverReq..CLE L1-Product Change Request              
SX08 = D..ABUTH1.SignalCLEToFIL.L1.DrainReq..CLE L1-Drain Request
SX09 = D..ABUTH1.SignalCLEToFIL.L1.CycleStandBy..CLE L1-Stand-By Cycle
SX10 = 
SX11 = 
SX12 = D..ABUTH1.SignalCLEToFIL.L1.RemoteControlEnable..CLE L1-Remote ControL Enable
SX13 = 
SX14 = D..ABUTH1.SignalCLEToFIL.L1.CycleStartOk..CLE L1-Cycle Start OK
SX15 = 
SX16 = 
SX17 = D..ABUTH1.SignalCLEToFIL.L1.SanitationAgentSend..CLE L1-Sanitation Agent Send
SX18 = D..ABUTH1.SignalCLEToFIL.L1.SanitationSendPhase..CLE L1-Sanitation Send Phase   
SX19 = 
SX20 =
SX21 = D..ABUTH1.SignalCLEToFIL.L1.SanitationEnd..CLE L1-End Sanitation
SX22 = 
SX23 = D..ABUTH1.SignalCLEToFIL.L1.RecipeUpdated..CLE L1-Recipe Updated
SX24 = 
SX25 = A..ABUTH1.SignalCLEToFIL.L1.ActiveWash..CLE L1-ActiveWash..CNTR..K1
SX26 = A..ABUTH1.SignalCLEToFIL.L1.ActivePhase..CLE L1-ActivePhase..CNTR..K1
SX27 = A..ABUTH1.SignalCLEToFIL.L1.ActiveStep..CLE L1-ActiveStep..CNTR..K1
SX28 = A..ABUTH1.SignalCLEToFIL.L1.ReceivedRecipeNumber..CLE L1-Recipe Number Received..CNTR..K1


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToPRO.CLE.CausticAvailable..Caustic Available
DX03 = D..ABFIL1.SignalFILToPRO.CLE.AcidAvailable..Acid Available
DX04 = 
DX05 = D..ABFIL1.SignalFILToPRO.CLE.L1.CriticalAlarm..Critical Alarm
DX06 = 
DX07 = D..ABFIL1.SignalFILToPRO.CLE.L1.ProductChangeOverEnd..Produt Chang End
DX08 = D..ABFIL1.SignalFILToPRO.CLE.L1.DrainEnd..Drain End                     
DX09 = D..ABFIL1.SignalFILToPRO.CLE.L1.InletValveOpen..Inlet Valve Open
DX10 = D..ABFIL1.SignalFILToPRO.CLE.L1.ReturnValveOpen..Return Valve Open
DX11 = 
DX12 = D..ABFIL1.SignalFILToPRO.CLE.L1.FillUpEnd..Fill Up End
DX13 = 
DX14 = 
DX15 = D..ABFIL1.SignalFILToPRO.CLE.L1.ReadyToSanitation..Ready To Sanitation
DX16 = D..ABFIL1.SignalFILToPRO.CLE.L1.SanitationStart..Sanitation Start
DX17 =             
DX18 =      
DX19 = 
DX20 = D..ABFIL1.SignalFILToPRO.CLE.L1.SanitationStop..Sanitation Stop 
DX21 = D..ABFIL1.SignalFILToPRO.CLE.L1.SanitationEndConfirm..Sanitation End Confirm
DX22 = 
DX23 = 
DX24 = D..ABFIL1.SignalFILToPRO.CLE.L1.NewRecipeSend..New Recipe Send
DX25 = D..ABFIL1.SignalFILToPRO.CLE.L1.ActiveRecipeAborted..Active Recipe Aborted
DX26 = 
DX27 = 
DX28 = A..ABFIL1.SignalFILToPRO.CLE.L1.RecipeToDo..Recipe To Do..CNTR..K1

;*************************************************


;*************************************************




[UDX_1]
;UNIDOX
SX01 = B..ECODOX
SX02 = D..ABUTH1.SignalUDXToFIL.CriticalAlarm..Critical Alarm
SX03 = D..ABUTH1.SignalUDXToFIL.MachineRunning..Machine Running
SX04 = D..ABUTH1.SignalUDXToFIL.DrainageRun..Drainage Run
SX05 = D..ABUTH1.SignalUDXToFIL.DrainageDone..Drainage Done
SX06 = D..ABUTH1.SignalUDXToFIL.ReadyForHydrBarrier..Ready For Hydr Barrier
SX07 = D..ABUTH1.SignalUDXToFIL.ReadyForProduction..Ready For Production
SX08 = D..ABUTH1.SignalUDXToFIL.PAASending..PAA Sending
SX09 = D..ABUTH1.SignalUDXToFIL.TempSetRecovery..Temp Set Recovery
SX10 = D..ABUTH1.SignalUDXToFIL.ConcSetRecovery..Conc Set Recovery
SX11 = D..ABUTH1.SignalUDXToFIL.DrainCycleActive..Drain Cycle Active
SX12 = D..ABUTH1.SignalUDXToFIL.PurePAAReq..Pure PAA Req
SX13 = D..ABUTH1.SignalUDXToFIL.WaterFromSterilcapReq..Water From Sterilcap Req
SX14 = D..ABUTH1.SignalUDXToFIL.WaterFromRinserReq..Water From  Rinser Req
SX15 = D..ABUTH1.SignalUDXToFIL.BottInletStopReq..Bott Inlet Stop Req
SX16 = D..ABUTH1.SignalUDXToFIL.Warning..Warning
SX17 = D..ABUTH1.SignalUDXToFIL.BasinPAALevelHighInProd..Basin PAA Level High InProd
SX18 = D..ABUTH1.SignalUDXToFIL.CI1PMP01Running..CI1PMP01 Running
SX19 = D..ABUTH1.SignalUDXToFIL.COPSending..COP Sending
SX20 = D..ABUTH1.SignalUDXToFIL.COPWaterReady..COP Water Ready
SX21 = D..ABUTH1.SignalUDXToFIL.COPCausticReady..COP Caustic Ready
SX22 = D..ABUTH1.SignalUDXToFIL.COPFinalRinsingReady..COP Final  RinsingReady
SX23 = D..ABUTH1.SignalUDXToFIL.COPCausticConcReq..COP CausticConc Req
SX24 = D..ABUTH1.SignalUDXToFIL.COPReadyForDB..COP Ready For D B
SX25 = D..ABUTH1.SignalUDXToFIL.COPDrainageComplete..COP DrainageComplete
SX26 = D..ABUTH1.SignalUDXToFIL.COPCycleEndConfirm..COPCycle EndConfirm
SX27 = D..ABUTH1.SignalUDXToFIL.COPCycleFailed..COPCycle Failed
SX28 = D..ABUTH1.SignalUDXToFIL.COPLastDrainComplete..COP Last DrainComplete


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToPRO.UDX.EmergencyPushButton..Emergency Push Button
DX03 = D..ABFIL1.SignalFILToPRO.UDX.RemoteStart..Remote Start
DX04 = D..ABFIL1.SignalFILToPRO.UDX.RemoteStop..Remote Stop
DX05 = D..ABFIL1.SignalFILToPRO.UDX.ResetButton..Reset Button
DX06 = D..ABFIL1.SignalFILToPRO.UDX.TestLampButton..Test Lamp Button
DX07 = D..ABFIL1.SignalFILToPRO.UDX.ProcessStopButton..Process Stop Button
DX08 = D..ABFIL1.SignalFILToPRO.UDX.CriticalAlarm..Critical Alarm
DX09 = D..ABFIL1.SignalFILToPRO.UDX.AlarmModeChange..Alarm Mode Change
DX10 = D..ABFIL1.SignalFILToPRO.UDX.DrainageReq..Drainage Req
DX11 = D..ABFIL1.SignalFILToPRO.UDX.DrainageResetted..Drainage Resetted
DX12 = D..ABFIL1.SignalFILToPRO.UDX.DrainageAborted..Drainage Aborted
DX13 = D..ABFIL1.SignalFILToPRO.UDX.HydrBarrReq..Hydr. Barr. Req.
DX14 = D..ABFIL1.SignalFILToPRO.UDX.PAAReq..PAA Req.
DX15 = D..ABFIL1.SignalFILToPRO.UDX.PAAConsumption..PAA Consumption
DX16 = D..ABFIL1.SignalFILToPRO.UDX.PurePAAAvailable..Pure PAA Available
DX17 = D..ABFIL1.SignalFILToPRO.UDX.ExtWayOpen..Ext Way Open
DX18 = D..ABFIL1.SignalFILToPRO.UDX.SanitationSetReq..SanitationSet Req
DX19 = D..ABFIL1.SignalFILToPRO.UDX.FDAEnable..FDA Enable
DX20 = D..ABFIL1.SignalFILToPRO.UDX.LAEnable..LA Enable
DX21 = D..ABFIL1.SignalFILToPRO.UDX.HAEnable..HA Enable
DX22 = D..ABFIL1.SignalFILToPRO.UDX.ESLEnable..ESL Enable
DX23 = D..ABFIL1.SignalFILToPRO.UDX.NOAsepticProdEnable..N O Aseptic Prod Enable
DX24 = D..ABFIL1.SignalFILToPRO.UDX.NOAsepticWaterEnable..N O Aseptic Water Enable
DX25 = D..ABFIL1.SignalFILToPRO.UDX.WaterRetFromSterilcapON..Water Ret. From Sterilcap
DX26 = D..ABFIL1.SignalFILToPRO.UDX.WaterRetFromRinserON..Water Ret. From Rinser
DX27 = D..ABFIL1.SignalFILToPRO.UDX.Sanitation..Sanitation
DX28 = D..ABFIL1.SignalFILToPRO.UDX.Production..Production



[UDX_2]
;UNIDOX

SX01 = B..ECODOX COP
SX02 = D..ABUTH1.SignalUDXToFIL.COPSending..COP Sending
SX03 = D..ABUTH1.SignalUDXToFIL.COPWaterReady..COP Water Ready
SX04 = D..ABUTH1.SignalUDXToFIL.COPCausticReady..COPCaustic Ready
SX05 = D..ABUTH1.SignalUDXToFIL.COPFinalRinsingReady..COP Final  RinsingReady
SX06 = D..ABUTH1.SignalUDXToFIL.COPCausticConcReq..COPCausticConc Req
SX07 = D..ABUTH1.SignalUDXToFIL.COPReadyForDB..COP Ready For Dummy Bottles
SX08 = D..ABUTH1.SignalUDXToFIL.COPDrainageComplete..COP DrainageComplete
SX09 = D..ABUTH1.SignalUDXToFIL.COPCycleEndConfirm..COPCycle EndConfirm
SX10 = D..ABUTH1.SignalUDXToFIL.COPCycleFailed..COP Cycle Failed
SX11 = D..ABUTH1.SignalUDXToFIL.COPLastDrainComplete..COP Last DrainComplete
SX12 = 
SX13 = D..ABUTH1.SignalUDXToFIL.SOPCycleEndConfirm..SOP  Cycle EndConfirm
SX14 = D..ABUTH1.SignalUDXToFIL.SelectorLampOn..Selector Lamp On
SX15 = D..ABUTH1.SignalUDXToFIL.FillerEnablePumpStart..Filler Enable Pump Start
SX16 = D..ABUTH1.SignalUDXToFIL.BiOx_Start..Bi Ox Start
SX17 = D..ABUTH1.SignalUDXToFIL.PMP02_Start..PMP02 Start
SX18 = D..ABUTH1.SignalUDXToFIL.ManualTitrationEnable..Manual Titration Enable
SX19 = D..ABUTH1.SignalUDXToFIL.OpenGSP07_Enable..Open GSP07 Enable
SX20 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP01..Req Open GSP01
SX21 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP07..Req Open GSP07
SX22 = D..ABUTH1.SignalUDXToFIL.ResetCarterGSP01_07..Reset Carter GSP01_07
SX23 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP03..Req Open GSP03
SX24 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP08..Req Open GSP08
SX25 = D..ABUTH1.SignalUDXToFIL.ResetCarterGSP03_08..Reset Carter GSP03_08
SX26 = A..ABUTH1.SignalUDXToFIL.PRMPV_CI1ManualTitration..Manual Titration..CONC..K1
SX27 = N..ABUTH1.SignalUDXToFIL.LocalDrainCycle..Local Drain Cycle
SX28 = 


DX01 = B..FILLER COP
DX02 = D..ABFIL1.SignalFILToPRO.UDX.COPReq..COP Req
DX03 = D..ABFIL1.SignalFILToPRO.UDX.COPWaterReq..COP Water Req
DX04 = D..ABFIL1.SignalFILToPRO.UDX.COPCausticReq..COP Caustic Req
DX05 = D..ABFIL1.SignalFILToPRO.UDX.COPRecoveryToCustomReq..COP  Recovery ToCustomReq
DX06 = D..ABFIL1.SignalFILToPRO.UDX.COPFinalRinsingReq..COP Final  RinsingReq
DX07 = D..ABFIL1.SignalFILToPRO.UDX.COPCausticConcAvailable..COPCausticConc Available
DX08 = D..ABFIL1.SignalFILToPRO.UDX.COPEnd..COP End
DX09 = D..ABFIL1.SignalFILToPRO.UDX.COPPAADosingEnable..COP PAA Dosing Enable
DX10 = D..ABFIL1.SignalFILToPRO.UDX.COPMiddlePhase..COP MiddlePhase
DX11 = D..ABFIL1.SignalFILToPRO.UDX.COPCausticPhaseFinished..COP CausticPhase Finished
DX12 = D..ABFIL1.SignalFILToPRO.UDX.COPResetted..COP Resetted
DX13 = D..ABFIL1.SignalFILToPRO.UDX.COPAborted..COP Aborted
DX14 = D..ABFIL1.SignalFILToPRO.UDX.COPFailed..COP Failed
DX15 = N..ABFIL1.SignalFILToPRO.UDX.COPTimePhasePre..C O   P TimePhasePre
DX16 = N..ABFIL1.SignalFILToPRO.UDX.COPTimePhaseAcc..C O  P TimePhase Acc
DX17 = 
DX18 =
DX19 = A..ABFIL1.SignalFILToPRO.UDX.WaterRetFromSterilcapFlow..Water Ret  From SterilcapFlow..FLWL..K1
DX20 = A..ABFIL1.SignalFILToPRO.UDX.BottlesNumbSterilizing..Bottles Numb Sterilizing..CNTR..K1
DX21 = A..ABFIL1.SignalFILToPRO.UDX.FillerSpeed..Filler Speed..SPDH..K1
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 =
DX28 = D..ABFIL1.SignalFILToPRO.UDX.SOPInProgress..SOP InProgress



[UDX_3]
;UNIDOX
SX01 = B..ECODOX
SX02 = D..ABUTH1.SignalUDXToFIL.OpenGSP07_Enable..Open G S P07_ Enable
SX03 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP01..Req Open G S P01
SX04 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP07..Req Open G S P07
SX05 = D..ABUTH1.SignalUDXToFIL.ResetCarterGSP01_07..Reset Carter G S P01_07      
SX06 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP03..Req Open G S P03
SX07 = D..ABUTH1.SignalUDXToFIL.ReqOpenGSP08..Req Open G S P08
SX08 = D..ABUTH1.SignalUDXToFIL.ResetCarterGSP03_08..Reset Carter G S P03_08
SX09 = N..ABUTH1.SignalUDXToFIL.VPW31_Out..VPW31 Out..PERC..K1
SX10 = A..ABUTH1.SignalUDXToFIL.RawPAAConc..Raw PAA Conc..CONC..K1
SX11 =
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = A..ABFIL1.SignalFILToPRO.UDX.WaterRetFromSterilcapFlow..Sterilcap Water Consumption FTW00..FLWL..K1
DX03 =A..ABFIL1.SignalFILToPRO.UDX.BottlesNumbSterilizing..n° of Bottle Sterilizing..CNTR..K1
DX04 =A..ABFIL1.SignalFILToPRO.UDX.FillerSpeed..Filler Speed..SPDH
DX08 = A..ABFIL1.SignalFILToPRO.UDX.ST1Pressure..Sterilizer1 Treatment Real Pressure 341PTP51..PRSM..K1
DX09 = A..ABFIL1.SignalFILToPRO.UDX.PAADosingPumpSpeedRef..PAA Dosing Pump Speed Reference..SPDP..K1
DX10 = D..ABFIL1.SignalFILToPRO.UDX.ST1PIDEnable..PID Enable on Sterilizer1 - 341VPP50 Open
DX11 =N..ABFIL1.SignalFILToPRO.UDX.PMP02StartReq..CD1PMP02 Recovery Pump Start Request
DX12 = D..ABFIL1.SignalFILToPRO.UDX.NoBottleInside..No Bottle Inside
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************


;*************************************************

[CIN_1]
;INLET CONVEYORS
SX01 = B..INLET CONVEYORS
SX02 = D..ABFIL1.SignalFILFromCIN.ComunicationStatus..Comunication Status
SX03 = D..ABFIL1.SignalFILFromCIN.CriticalAlarm..Critical Alarm
SX04 = D..ABFIL1.SignalFILFromCIN.Running..Running
SX05 = D..ABFIL1.SignalFILFromCIN.HighSpeed..High Speed
SX06 = D..ABFIL1.SignalFILFromCIN.BottlesGateOpen..Bottles Gate Open
SX07 = D..ABFIL1.SignalFILFromCIN.StandbyReq..Standby Req
SX08 = D..ABFIL1.SignalFILFromCIN.ReadyForEmptying..Ready For Emptying
SX09 = N..ABFIL1.SignalFILFromCIN.Spare_07..Spare_07
SX10 = N..ABFIL1.SignalFILFromCIN.Spare_08..Spare_08
SX11 = N..ABFIL1.SignalFILFromCIN.ScanComunication..Scan Comunication
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToCIN.CriticalAlarm..Critical Alarm
DX03 = D..ABFIL1.SignalFILToCIN.Running..Running
DX04 = D..ABFIL1.SignalFILToCIN.BottleStopOpened..Bottle Stop Opened
DX05 = D..ABFIL1.SignalFILToCIN.DeliveryGateOpenReq..Delivery Gate Open Req
DX06 = D..ABFIL1.SignalFILToCIN.EmptyingReq..Emptying Req
DX07 = D..ABFIL1.SignalFILToCIN.FillerInSanitation..Filler In Sanitation
DX08 = A..ABFIL1.SignalFILToCIN.Speed..Filler Speed..SPDH..K1
DX09 =  
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************


;*************************************************

[COU_1]
;OUTLET CONVEYORS

SX01 = B..OUTLET CONVEYORS
SX02 = 
SX03 = 
SX04 = 
SX05 =                                           
SX06 = D..ABFIL1.SignalFilFromCOU.ConveyorsRunning..Outlet Conveyors Running
SX07 = D..ABFIL1.SignalFilFromCOU.HighSpeedEnable..Bottles Jammed on Conveyor (Outlet filler)
SX08 = D..ABFIL1.SignalFilFromCOU.BottlesGateOpenEnable..Gate Open Enable                              
SX09 = D..ABFIL1.SignalFILFromCOU.SamplingConvRun..Ready to run from sampling conveyor
SX10 = 
SX11 =
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 =D..ABFIL1.SignalFilFromCOU.CriticalAlarm..Critical Alarm (1=OK)


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFilToCOU.ComCheck.. Communication Check
DX03 = 
DX04 = 
DX05 =                                        
DX06 = D..ABFIL1.SignalFilToCOU.MachineRunning..Machine Running in Production                         
DX07 = D..ABFIL1.SignalFilToCOU.OutConveyorRunning..Outlet Filler Conveyor Running
DX08 = D..ABFIL1.SignalFILToCOU.ProgressiveEjectorOn..Progressive Ejector On                                   
DX09 = D..ABFIL1.SignalFILToCOU.BottlesInsideFiller..Bottles Inside Filler                                   
DX10 = A..ABFIL1.SignalFilToCOU.Speed..Filler Speed..SPDH..K1
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = D..ABFIL1.SignalFilToCOU.CriticalAlarm..Critical Alarm (1=OK) 


;*************************************************


;*************************************************


[SI1_1]
;STERILCAP
SX01 =B..STERILCAP IM
SX02 =
SX03 =N..ABFIL1.SignalFILFromUFA.ActiveTankPressure..analogTEST..PRSM 
SX04 =D..ABFIL1.SignalFILFromSI1.MachineReady..Machine Ready
SX05 = 
SX06 =..ABFIL1...
SX07 = D..ABFIL1.SignalFILFromSI1.PaaReq..PAA Request
SX08 = D..ABFIL1.SignalFILFromSI1.SlowDownLackOfCaps..Slow Down Lack Of Caps
SX09 = D..ABFIL1.SignalFILFromSI1.StopLackOfCaps..Stop Lack Of Caps
SX10 = D..ABFIL1.SignalFILFromSI1.CapsReq..Caps Request
SX11 = D..ABFIL1.SignalFILFromSI1.StartUpDone..Start Up Done
SX12 = D..ABFIL1.SignalFILFromSI1.CapsChuteFull..Caps Chute Full (Inlet Channel)
SX13 = D..ABFIL1.SignalFILFromSI1.Warning..Warning
SX14 = D..ABFIL1.SignalFILFromSI1.DoorAlarmSide1..Door Alarm Side 1
SX15 = D..ABFIL1.SignalFILFromSI1.RecoveryWaterOn..Recovery Water To EcoDox available
SX16 =
SX17 =
SX18 =
SX19 =N..ABFIL1.SignalFILFromSI1.BottInletStopReq..Bottles Inlet Stop request
SX20 = D..ABFIL1.SignalFILFromSI1.BottInletStopReq..Bottles Inlet Stop request
SX21 = D..ABFIL1.SignalFILFromSI1.SterilcapNotRunning..Sterilcap not Running
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 



DX01 = B..FILLER
DX02 = N..ABFIL1.SignalFILToSI1.ComCheck.AreYouThere..Communication Check – Request to Partner
DX03 = N..ABFIL1.SignalFILToSI1.ComCheck.YesImOK..Communication Check – Reply to Partner
DX04 = D..ABFIL1.SignalFILToSI1.CriticalAlarm..Critical Alarm
DX05 = 
DX06 = D..ABFIL1.SignalFILToSI1.OnProdOffSanitation..Production (1=Prod,0= Sanit.)
DX07 = D..ABFIL1.SignalFILToSI1.PaaLineSterilization..PAA Line Sterilization
DX08 = D..ABFIL1.SignalFILToSI1.RinseAfterPaaSteril..Rinsing After PAA Sterilization          
DX09 = D..ABFIL1.SignalFILToSI1.AirFlushing..Air Flushing
DX10 = D..ABFIL1.SignalFILToSI1.DrainReq..Drainage Request
DX11 = 
DX12 = D..ABFIL1.SignalFILToSI1.PaatTreatmentOpening..PAA Treatement Opening
DX13 = D..ABFIL1.SignalFILToSI1.PaaReady..PAA Ready
DX14 = D..ABFIL1.SignalFILToSI1.SterilWaterReady..Sterile Water Ready
DX15 = D..ABFIL1.SignalFILToSI1.StartEnable..Start Enable
DX16 = D..ABFIL1.SignalFILToSI1.SterilAirReady..Sterile Air Ready
DX17 = D..ABFIL1.SignalFILToSI1.EndProdReq..End Production request
DX18 = D..ABFIL1.SignalFILToSI1.EmptyingReq..Emptying Request-Short Cycle In Production
DX19 = D..ABFIL1.SignalFILToSI1.ShortSterilizationStart..Short Sterilization Start          
DX20 = D..ABFIL1.SignalFILToSI1.CapsReleaseOnFillerRunning..Caps release Open And Filler Running
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************

[SI1_2]
;STERILCAP

SX01 = B..STERILCAP
SX02 = 
SX03 = 
SX04 = 
SX05 = 
SX06 = 
SX07 = 
SX08 = 
SX09 = 
SX10 =
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 =
SX16 =
SX17 =
SX18 =
SX19 =
SX20 =
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSI1.StartTreatmentPreEating..Caps release Open And Filler Running
DX03 = D..ABFIL1.SignalFILToSI1.FillerStopPhotocel..Stop Photoeye Caps Chute Empty
DX04 = D..ABFIL1.SignalFILToSI1.ZoneCycleActive1..Zone Active 1
DX05 = D..ABFIL1.SignalFILToSI1.ZoneCycleActive2..Zone Active 2
DX06 = D..ABFIL1.SignalFILToSI1.SmartCalibWaterOpen..Smart Sensor Calibration - Water Line
DX07 = D..ABFIL1.SignalFILToSI1.SmartCalibPaaOpen..Smart Sensor Calibration - PAA Line
DX08 = D..ABFIL1.SignalFILToSI1.CapsChuteAirOpenRequest..Air To Caps Chute Request
DX09 = D..ABFIL1.SignalFILToSI1.LowAcidProduction..Low Acid Production
DX10 = D..ABFIL1.SignalFILToSI1.HighAcidProduction..High Acid Production
DX11 = D..ABFIL1.SignalFILToSI1.WaterRecoveryFromUnidox..Water Recovery From Unidox
DX12 = D..ABFIL1.SignalFILToSI1.PaaRecovery..PAA Recovery 
DX13 = D..ABFIL1.SignalFILToSI1.FillerNotRunning..Filler Not Running
DX14 = D..ABFIL1.SignalFILToSI1.TankLoadingEnable..Paa Tank Enable
DX15 =
DX16 =
DX17 =
DX18 =
DX19 =
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 




;*************************************************


[SI2_1]
;STERILCAP

SX01 = B..STERILCAP IM2
SX02 = D..ABFIL1.SignalFILFromSC2.ComCheck.AreYouThere..Communication Check – Request to Partner
SX03 = D..ABFIL1.SignalFILFromSC2.ComCheck.YesImOK..Communication Check – Reply to Partner
SX04 =                  
SX03 = D..ABFIL1.SignalFILFromSC2.CriticalAlarm..Critical Alarm


SX04 = D..ABFIL1.SignalFILFromSC2.BottInletStopReq..
SX05 = D..ABFIL1.SignalFILFromSC2.MachineReady..Machine Ready
SX06 = D..ABFIL1.SignalFILFromSC2.SterilWaterReq..Sterile Water Request
SX07 = D..ABFIL1.SignalFILFromSC2.PaaReq..PAA Request
SX08 = D..ABFIL1.SignalFILFromSC2.SlowDownLackOfCaps..Slow Down Lack Of Caps
SX09 = D..ABFIL1.SignalFILFromSC2.StopLackOfCaps..Stop Lack Of Caps
SX10 = D..ABFIL1.SignalFILFromSC2.CapsReq..Caps Request
SX11 = D..ABFIL1.SignalFILFromSC2.StartUpDone..Start Up Done
SX12 = D..ABFIL1.SignalFILFromSC2.CapsChuteFull..Caps Chute Full
SX13 = D..ABFIL1.SignalFILFromSC2.Warning..Warning
SX14 = D..ABFIL1.SignalFILFromSC2.DoorAlarmSide1..Door Alarm Side 1
SX15 = D..ABFIL1.SignalFILFromSC2.RecoveryWaterOn..Recovery Water On  
SX16 =
SX17 =
SX18 =
SX19 =
SX20 =
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSC2.ComCheck.AreYouThere..Communication Check – Request to Partner
DX03 = D..ABFIL1.SignalFILToSC2.ComCheck.YesImOK..Communication Check – Reply to Partner
DX04 = 
DX05 = D..ABFIL1.SignalFILToSC2.CriticalAlarm..Critical Alarm


DX06 = D..ABFIL1.SignalFILToSC2.OnProdOffSanitation..Production (1=Prod,0= Sanit.)
DX07 = D..ABFIL1.SignalFILToSC2.PaaLineSterilization..PAA Line Sterilization
DX08 = D..ABFIL1.SignalFILToSC2.RinseAfterPaaSteril..Rinsing After PAA Sterilization          
DX09 = D..ABFIL1.SignalFILToSC2.AirFlushing..Air Flushing
DX10 = D..ABFIL1.SignalFILToSC2.DrainReq..Drainage Request
DX11 = 
DX12 = D..ABFIL1.SignalFILToSC2.PaatTreatmentOpening..PAA Treatement Opening
DX13 = D..ABFIL1.SignalFILToSC2.PaaReady..PAA Ready
DX14 = D..ABFIL1.SignalFILToSC2.SterilWaterReady..Sterile Water Ready
DX15 = D..ABFIL1.SignalFILToSC2.StartEnable..Start Enable
DX16 = D..ABFIL1.SignalFILToSC2.SterilAirReady..Sterile Air Ready
DX17 = D..ABFIL1.SignalFILToSC2.EndProdReq..End Production request
DX18 = D..ABFIL1.SignalFILToSC2.EmptingReq..Emptying Request-Short Cycle In Production
DX19 = D..ABFIL1.SignalFILToSC2.ShortSterilizationStart..Short Sterilization Start          
DX20 = D..ABFIL1.SignalFILToSC2.CapsReleaseOnFillerRunning..Caps release Open And Filler Running
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************

[SI2_2]
;STERILCAP

SX01 = B..STERILCAP
SX02 = 
SX03 = 
SX04 = 
SX05 = 
SX06 = 
SX07 = 
SX08 = 
SX09 = 
SX10 =
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 =
SX16 =
SX17 =
SX18 =
SX19 =
SX20 =
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSC2.StartTreatmentPreEating..Caps release Open And Filler Running
DX03 = D..ABFIL1.SignalFILToSC2.FillerStopPhotocel..Stop Photoeye Caps Chute Empty
DX04 = D..ABFIL1.SignalFILToSC2.ZoneCycleActive1..Zone Active 1
DX05 = D..ABFIL1.SignalFILToSC2.ZoneCycleActive2..Zone Active 2
DX06 = D..ABFIL1.SignalFILToSC2.SmartCalibWaterOpen..Smart Sensor Calibration - Water Line
DX07 = D..ABFIL1.SignalFILToSC2.SmartCalibPaaOpen..Smart Sensor Calibration - PAA Line
DX08 = D..ABFIL1.SignalFILToSC2.CapsChuteAirOpenRequest..Air To Caps Chute Request
DX09 = D..ABFIL1.SignalFILToSC2.LowAcidProduction..Low Acid Production
DX10 = D..ABFIL1.SignalFILToSC2.HighAcidProduction..High Acid Production
DX11 = D..ABFIL1.SignalFILToSC2.WaterRecoveryFromUnidox..Water Recovery From Unidox
DX12 = D..ABFIL1.SignalFILToSC2.PaaRecovery..PAA Recovery 
DX13 = D..ABFIL1.SignalFILToSC2.FillerNotRunning..Filler Not Running
DX14 = D..ABFIL1.SignalFILToSC2.TankLoadingEnable..Paa Tank Enable
DX15 =
DX16 =
DX17 =
DX18 =
DX19 =
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************

[SH1_1]
;sTERILCAP

SX01 = B..STERILCAP VHP
SX02 =D..ABFIL1.SignalFILFromSH1.CriticalAlarm..Critical Alarm
SX03 =D..ABFIL1.SignalFILFromSH1.MachineRunning..Machine Running
SX04 =D..ABFIL1.SignalFILFromSH1.BottInletStopReq..Bott Inlet Stop Req
SX05 =D..ABFIL1.SignalFILFromSH1.MachineReady..Machine Ready
SX06 =D..ABFIL1.SignalFILFromSH1.H2O2Req..H2O2 Req
SX07 =D..ABFIL1.SignalFILFromSH1.SOPAvailable..SOP Available
SX08 =D..ABFIL1.SignalFILFromSH1.SterilizationDone..Sterilization Done
SX09 =D..ABFIL1.SignalFILFromSH1.SlowDownLackOfCaps..Slow Down Lack Of Caps
SX10 =D..ABFIL1.SignalFILFromSH1.StopLackOfCaps..Stop Lack Of Caps
SX11 =D..ABFIL1.SignalFILFromSH1.CapsReq..Caps Req
SX12 =D..ABFIL1.SignalFILFromSH1.StartUpDone..Start Up Done
SX13 =D..ABFIL1.SignalFILFromSH1.CapsChuteFull..Caps Chute Full
SX14 =D..ABFIL1.SignalFILFromSH1.Warning..Warning
SX15 =D..ABFIL1.SignalFILFromSH1.Hopper1Selection..Hopper 1 Selection
SX16 =D..ABFIL1.SignalFILFromSH1.Hopper2Selection..Hopper 2 Selection
SX17 =D..ABFIL1.SignalFILFromSH1.SterilcapNotRunning..Sterilcap Not Running
SX18 =D..ABFIL1.SignalFILFromSH1.H2O2LoadingTimeout..H2O2 Loading Timeout
SX19 =D..ABFIL1.SignalFILFromSH1.H2O2PipeDrainageReq..H2O2 Pipe Drainage Req
SX20 =D..ABFIL1.SignalFILFromSH1.H2O2TitrationReq..H2O2 Titration Req 
SX21 =D..ABFIL1.SignalFILFromSH1.ResetEndProduction..Reset End Production
SX22 =D..ABFIL1.SignalFILFromSH1.FilteredAirReq..Filtered Air Req
SX23 =N..ABFIL1.SignalFILFromSH1.GeneralStatus..General Status
SX24 =N..ABFIL1.SignalFILFromSH1.StopEventSC..StopEventSC
SX25 =N..ABFIL1.SignalFILFromSH1.ConfigOfStopEventSC..Config Of Stop Event SC
SX26 =N..ABFIL1.SignalFILFromSH1.Extra1StopEventSC..Extra1 StopEvent SC
SX27 =N..ABFIL1.SignalFILFromSH1.Extra2StopEventSC..Extra2 StopEvent SC
SX28 = 

DX01 = B..FILLER
DX02 =D..ABFIL1.SignalFILToSH1.RemoteStart..Remote Start
DX03 =D..ABFIL1.SignalFILToSH1.RemoteStop..Remote Stop
DX04 =D..ABFIL1.SignalFILToSH1.ResetButton..Reset Button
DX05 =D..ABFIL1.SignalFILToSH1.ProcessStopButton..Process Stop Button
DX06 =D..ABFIL1.SignalFILToSH1.CriticalAlarm..Critical Alarm
DX07 =D..ABFIL1.SignalFILToSH1.AlarmModeChange..Alarm Mode Change
DX08 =D..ABFIL1.SignalFILToSH1.BlocEmpty..Bloc Empty
DX09 =D..ABFIL1.SignalFILToSH1.Production..Production
DX10 =D..ABFIL1.SignalFILToSH1.Sanitation..Sanitation
DX11 =D..ABFIL1.SignalFILToSH1.ISOReadySterilCondition..ISO Ready Steril Condition   
DX12 =D..ABFIL1.SignalFILToSH1.DrainReq..Drain Req
DX13 =D..ABFIL1.SignalFILToSH1.COPActive..COP Active
DX14 =D..ABFIL1.SignalFILToSH1.SOPActive..SOP Active
DX15 =D..ABFIL1.SignalFILToSH1.PAALineSterilization..PAA Line Sterilization
DX16 =D..ABFIL1.SignalFILToSH1.RinseAfterPAASteril..Rinse After PAA Steril
DX17 =D..ABFIL1.SignalFILToSH1.PurgeAfterPAASteril..Purge After PAA Steril
DX18 =D..ABFIL1.SignalFILToSH1.PAACycleFailed..PAA Cycle Failed
DX19 =D..ABFIL1.SignalFILToSH1.AirFlushing..Air Flushing
DX20 =D..ABFIL1.SignalFILToSH1.CapsStartUpReq..Caps Start Up Req
DX21 =D..ABFIL1.SignalFILToSH1.StartTreatPreHeating..Start Treat Pre Heatingng 
DX22 =D..ABFIL1.SignalFILToSH1.DisableChamberHeating..Disable Chamber Heating
DX23 =D..ABFIL1.SignalFILToSH1.H2O2Available..H2O2 Available
DX24 =D..ABFIL1.SignalFILToSH1.H2O2LowLevel..H2O2 LowLevel
DX25 =D..ABFIL1.SignalFILToSH1.EndProdH2O2..End Prod H2O2
DX26 =D..ABFIL1.SignalFILToSH1.H2O2PipeDrainageDone..H2O2 Pipe Drainage Done
DX27 =D..ABFIL1.SignalFILToSH1.StartEnable..Start Enable
DX28 =D..ABFIL1.SignalFILToSH1.EndProdReq..End Prod Req

[SH1_2]
;sTERILCAP

SX01 = B..STERILCAP VHP
SX02 =D..ABFIL1.SignalFILFromSH1.CriticalAlarm..Critical Alarm
SX03 =
SX04 =
SX05 =
SX06 =
SX07 =
SX08 =
SX09 =
SX10 =
SX11 =
SX12 =
SX13 =
SX14 =
SX15 =
SX16 =
SX17 =
SX18 =
SX19 =
SX20 =
SX21 =
SX22 =
SX23 =
SX24 =
SX25 =
SX26 =
SX27 =
SX28 =

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSH1.EmptyingReq..Emptying Req
DX03 = D..ABFIL1.SignalFILToSH1.ShortCycleStart..Short Cycle Start
DX04 = D..ABFIL1.SignalFILToSH1.ShortSterilizationStart..ShortSterilizationStart
DX05 = D..ABFIL1.SignalFILToSH1.CapsRelOpening..CapsRelOpening
DX06 = D..ABFIL1.SignalFILToSH1.CapsRelOnFillerRunning..CapsRelOnFillerRunning
DX07 = D..ABFIL1.SignalFILToSH1.StartTreatmentPreHeating..StartTreatmentPreHeating
DX08 = D..ABFIL1.SignalFILToSH1.FillerStopPhotocel..FillerStopPhotocel
DX09 = D..ABFIL1.SignalFILToSH1.ZoneCycleActive1..ZoneCycleActive1
DX10 = D..ABFIL1.SignalFILToSH1.ZoneCycleActive2..ZoneCycleActive2
DX11 = D..ABFIL1.SignalFILToSH1.ZoneCycleActive3..ZoneCycleActive3
DX12 = D..ABFIL1.SignalFILToSH1.CapsChuteAirOpenRequest..CapsChuteAirOpenRequest
DX13 = D..ABFIL1.SignalFILToSH1.FDAEnable..FDAEnable
DX14 = D..ABFIL1.SignalFILToSH1.LAEnable..LAEnable
DX15 = D..ABFIL1.SignalFILToSH1.HAEnable..HAEnable
DX16 = D..ABFIL1.SignalFILToSH1.ESLEnable..ESLEnable
DX17 = D..ABFIL1.SignalFILToSH1.NOAsepticProdEnable..NOAsepticProdEnable
DX18 = D..ABFIL1.SignalFILToSH1.NOAsepticWaterEnable..NOAsepticWaterEnable
DX19 = D..ABFIL1.SignalFILToSH1.Channel1Active..Channel1Active
DX20 = D..ABFIL1.SignalFILToSH1.Channel2Active..Channel2Active
DX21 = D..ABFIL1.SignalFILToSH1.FillerNotRunning..FillerNotRunning
DX22 = D..ABFIL1.SignalFILToSH1.ProdEmptyingReq..ProdEmptyingReq
DX23 = D..ABFIL1.SignalFILToSH1.ISORunning..ISORunning
DX24 = D..ABFIL1.SignalFILToSH1.ExhausterRunning..ExhausterRunning
DX25 = D..ABFIL1.SignalFILToSH1.FilteredAirReady..FilteredAirReady
DX26 = D..ABFIL1.SignalFILToSH1.PAARinseDone..PAARinseDone
DX27 = D..ABFIL1.SignalFILToSH1.StartHepaCycle..StartHepaCycle
DX28 = D..ABFIL1.SignalFILToSH1.EnableStartAirFlow..EnableStartAirFlow



;*************************************************

[SV1_1]
;sTERILCAP

SX01 = B..STERILCAP VHP
SX02 =D..ABFIL1.SignalFILFromSV1.CriticalAlarm..Critical Alarm
SX03 =D..ABFIL1.SignalFILFromSV1.BottInletStopReq..Bottle Inlet Stop Request
SX04 =D..ABFIL1.SignalFILFromSV1.MachineReady..Machine Ready                  
SX05 =D..ABFIL1.SignalFILFromSV1.SterilizationDone..Sterilization Done
SX06 =
SX07 =D..ABFIL1.SignalFILFromSV1.Warning..Warning
SX08 =
SX09 =
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = D..ABFIL1.SignalFILFromSV1.H2O2Request..H2O2 Request
SX19 = N..ABFIL1.SignalFILFromSV1.SOPAvailable..SOP available
SX20 = D..ABFIL1.SignalFILFromSV1.SlowDownLackOfCaps..Slow Down Lack Of Caps   
SX21 = D..ABFIL1.SignalFILFromSV1.StopLackOfCaps..Stop Lack Of Caps
SX22 = D..ABFIL1.SignalFILFromSV1.CapsReq..Caps Request
SX23 = D..ABFIL1.SignalFILFromSV1.StartUpDone..Start Up done
SX24 = D..ABFIL1.SignalFILFromSV1.CapsChuteFull..Caps Chute Full
SX25 = 
SX26 = 
SX27 = D..ABFIL1.SignalFILFromSV1.AllMotorAuto..All Motor In Auto 
SX28 = D..ABFIL1.SignalFILFromSV1.AllValveAuto..All Valve In Auto

DX01 = B..FILLER
DX02 =D..ABFIL1.SignalFILToSV1.CriticalAlarm..Critical Alarm
DX03 =D..ABFIL1.SignalFILToSV1.BlocEmpty..Bloc empty
DX04 =D..ABFIL1.SignalFILToSV1.Production..Production 
DX05 =D..ABFIL1.SignalFILToSV1.Sanitation..Sanitation 
DX06 =D..ABFIL1.SignalFILToSV1.COPActive..COP active
DX07 =D..ABFIL1.SignalFILToSV1.StartUpRequest..Start Up request
DX08 =D..ABFIL1.SignalFILToSV1.SecondStepStartUpEnable..Second step Start Up enable
DX09 =D..ABFIL1.SignalFILToSV1.DisableChamberHeating..Disable Chamber Heating (COP act.inside)
DX10 =D..ABFIL1.SignalFILToSV1.PaaLineSterilization..PAA Line Sterilization
DX11 =D..ABFIL1.SignalFILToSV1.RinseAfterPaaSteril..Rinsing After PAA Sterilization         
DX12 =D..ABFIL1.SignalFILToSV1.AirFlushing..Air Flushing 
DX13 =D..ABFIL1.SignalFILToSV1.DrainReq..Drainage Request 
DX14 =D..ABFIL1.SignalFILToSV1.H2O2Available..H2O2 Available 
DX15 =D..ABFIL1.SignalFILToSV1.H2O2LowLevel..H2O2 Low level 
DX16 =D..ABFIL1.SignalFILToSV1.StartEnable..Start Enable 
DX17 =D..ABFIL1.SignalFILToSV1.EndProdReq..End Production request 
DX18 =D..ABFIL1.SignalFILToSV1.EmptyingReq..Emptying Request-Short Cycle In Production 
DX19 =D..ABFIL1.SignalFILToSV1.PAALineSterilization.. PAA Sterilization 
DX20 =D..ABFIL1.SignalFILToSV1.ShortSterilizationStart..Short Sterilization Start          
DX21 =D..ABFIL1.SignalFILToSV1.CapsReleaseOnFillerRunning..Caps release Open And Filler Running 
DX22 =
DX23 =
DX24 =D..ABFIL1.SignalFILToSV1.ZoneCycleActive1..Zone Active 1 
DX25 =D..ABFIL1.SignalFILToSV1.ZoneCycleActive2..Zone Active 2 
DX26 =D..ABFIL1.SignalFILToSv1.CapsChuteAirOpenRequest..Air To Caps Chute Request
DX27 =
DX28 = 

;*************************************************

[SV1_2]
;sTERILCAP

SX01 = B..STERILCAP VHP
SX02 = 
SX03 = 
SX04 = 
SX05 = 
SX06 = 
SX07 = 
SX08 = D..ABFIL1.SignalFILFromSV1.Hopper1Selection.. Hopper 1 Selection 
SX09 = D..ABFIL1.SignalFILFromSV1.Hopper2Selection.. Hopper 2 Selection 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = A..ABFIL1.SignalFILFromSV1.CapsCounter..Caps Inside Machine..CNTR..K1
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSV1.LAEnable..Sterilcap Product Low Acid 
DX03 = D..ABFIL1.SignalFILToSV1.HAEnable..Sterilcap Product High Acid 
DX04 = D..ABFIL1.SignalFILToSV1.FDAEnable..Sterilcap Product FDA 
DX05 = D..ABFIL1.SignalFILToSV1.ESLEnable..Sterilcap Product ESL 
DX06 = 
DX07 = D..ABFIL1.SignalFILToSV1.FillerNotRunning..Filler not Running
DX08 = D..ABFIL1.SignalFILToSV1.Channel1Active..Channel 1 Active
DX09 = D..ABFIL1.SignalFILToSV1.Channel2Active..Channel 2 Active
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 

;*************************************************

;*************************************************

[CAP_1]
;CAPS HOPPER

SX01 = B..CAPS HOPPER
SX02 = D..ABFIL1.SignalFILFromCAP.Alarm..Alarm
SX03 = D..ABFIL1.SignalFILFromCAP.LackOfCaps..LackOfCaps
SX04 = D..ABFIL1.SignalFILFromCAP.AutomaticMode..AutomaticMode                 
SX05 = D..ABFIL1.SignalFILFromCAP.InspectorAlarm..InspectorAlarm                                          
SX06 = D..ABFIL1.SignalFILFromCAP.FeedbackDividerOnHopper1..FeedbackDividerOnHopper1
SX07 = D..ABFIL1.SignalFILFromCAP.FeedbackDividerOnHopper2..FeedbackDividerOnHopper2
SX08 = D..ABFIL1.SignalFILFromCAP.FeedbackDividerOnHopper3..FeedbackDividerOnHopper3
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToCAP.Alarm..Alarm
DX03 = D..ABFIL1.SignalFILToCAP.PreProductionRequest..PreProductionRequest
DX04 = D..ABFIL1.SignalFILToCAP.CapsRequest..CapsRequest
DX05 = D..ABFIL1.SignalFILToCAP.SignalingDividerOnHopper1..SignalingDividerOnHopper1                    
DX06 = D..ABFIL1.SignalFILToCAP.SignalingDividerOnHopper2..SignalingDividerOnHopper2
DX07 = D..ABFIL1.SignalFILToCAP.SignalingDividerOnHopper3..SignalingDividerOnHopper3
DX08 = D..ABFIL1.SignalFILToCAP.CapsTypeSelectionB0..CapsTypeSelectionB0
DX09 = D..ABFIL1.SignalFILToCAP.CapsTypeSelectionB1..CapsTypeSelectionB1
DX10 =                     
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************


;*************************************************

[MAS_1]
;MASELLI

SX01 = B..UNIDOX
SX02 = D..ABFIL1.O:8/8..PAA Request
SX03 = 
SX04 =                  
SX05 = 
SX06 = 
SX07 = 
SX08 = 
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..MASELLI
DX02 = D..ABFIL1.I:6/10..PAA Low Level
DX03 = 
DX04 = 
DX05 = 
DX06 = 
DX07 = 
DX08 = 
DX09 = 
DX10 =                                      
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 



;*************************************************

;*************************************************

[CLR_1]
;CLEAN ROOM

SX01 = B..CLEAN ROOM
SX02 = D..ABFIL1.SignalFILFromCLR.ComCheck.AreYouThere..Communication Check – Request to Partner
SX03 = D..ABFIL1.SignalFILFromCLR.ComCheck.YesImOK..Communication Check – Reply to Partner
SX04 =                  
SX05 = D..ABFIL1.SignalFILFromCLR.Alarm..Critical Alarm (1=OK)            

SX06 = D..ABFIL1.SignalFILFromCLR.Running..Clean Room Running
SX07 = D..ABFIL1.SignalFILFromCLR.PressureAlarm..Clean Room Pressure Alarm
SX08 = 
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToCLR.ComCheck.AreYouThere..Communication Check – Request to Partner
DX03 = D..ABFIL1.SignalFILToCLR.ComCheck.YesImOK..Communication Check – Reply to Partner
DX04 = 
DX05 = D..ABFIL1.SignalFILtoCLR.Alarm..Critical Alarm (1=OK)            
DX06 = D..ABFIL1.SignalFILToCLR.Production..Request set Production
DX07 = D..ABFIL1.SignalFILToCLR.Sanitation..Request set Sanitation
DX08 =
DX09 = 
DX10 =                                      
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************


;*************************************************

[CHE_1]
;CHEMICAL <--> FILLER

SX01 = B..CHEMICAL
SX02 = 
SX03 = 
SX04 =                  
SX05 = D..ABFIL1.SignalFILFromCHE.CausticAvailable..Lye Ready
SX06 = D..ABFIL1.SignalFILFromCHE.CausticLowLevel..Lye Low Level
SX07 = D..ABFIL1.SignalFILFromCHE.AcidAvailable..Acid Ready
SX08 = D..ABFIL1.SignalFILFromCHE.AcidLowLevel..Acid Low Level
SX09 = D..ABFIL1.SignalFILFromCHE.PAAAvailable..PAA Ready
SX10 = D..ABFIL1.SignalFILFromCHE.PAALowLevel..PAA Low Level
SX11 = N..ABFIL1.SignalFILFromCHE.AdjuvantAvailable..Adjuvant Ready
SX12 = N..ABFIL1.SignalFILFromCHE.AdjuvantLowLevel..Adjuvant low Level
SX13 =N..ABFIL1.SignalFILFromCHE.BisulphiteAvailable..Bisulphite Ready (NOT USED)
SX14 =D..ABFIL1.SignalFILFromCHE.BisulphiteLowLevel..Bisulphite low Level
SX15 = D..ABFIL1.SignalFILFromCHE.H2O2Available..H2O2 Ready
SX16 = D..ABFIL1.SignalFILFromCHE.H2O2LowLevel..H2O2 LowLevel
SX17 =D..ABFIL1.SignalFILFromCHE.ReadyToReceiveCaustic..Ready To Receive Caustic
SX18 =D..ABFIL1.SignalFILFromCHE.ReadyToReceiveAcid..Ready To Receive Acid
SX19 = 
SX20 =
SX21 =..ABFIL1... 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 =  D..ABFIL1.SignalFILFromCHE.CriticalAlarm..Critical Alarm (1=OK)


DX01 = B..FILLER
DX02 = 
DX03 = 
DX04 = 
DX05 = D..ABFIL1.SignalFILToCHE.CausticRequest..Lye Request
DX06 = 
DX07 = D..ABFIL1.SignalFILToCHE.AcidRequest..Acid Request
DX08 = 
DX09 = D..ABFIL1.SignalFILToCHE.PAARequest..PAA Request
DX10 =
DX11 = N..ABFIL1.SignalFILToCHE.AdjuvantRequest..Adjuvant Request
DX12 = 
DX13 =N..ABFIL1.SignalFILToCHE.BisulphiteRequest..Bisulphite Request 
DX14 = 
DX15 = D..ABFIL1.SignalFILToCHE.H2O2Request..H2O2 Request 
DX16 = 
DX17 = D..ABFIL1.SignalFILToCHE.ReturnPumpRunCausticPhase..Return Pump Run Caustic Phase
DX18 = D..ABFIL1.SignalFILToCHE.ReturnPumpAcidPhase..Return Pump Run Acid Phase
DX19 = 
DX20 = 
DX21 = 
DX22 =..ABFIL1... 
DX23 =....ABFIL1.ABFIL1.ABFIL1.ABFIL1... 
DX24 =..ABFIL1... 
DX25 = 
DX26 = 
DX27 = 
DX28 = D..ABFIL1.SignalFILToCHE.CriticalAlarm..Critical Alarm (1=OK)


;*************************************************


;*************************************************

[CHE1_1]
;CHEMICAL <--> 	UNIDOX

SX01 = B..Chemical Unidox
SX02 = D..ABFIL1.SignalFILFromCHE1.Unidox.HearBit..Communication Check
SX03 = 
SX04 = D..ABFIL1.SignalFILFromCHE1.Unidox.CausticSystemReady..Caustic System Ready                 
SX05 = D..ABFIL1.SignalFILFromCHE1.Unidox.CausticValveOpen..Caustic Valve Open
SX06 = D..ABFIL1.SignalFILFromCHE1.Unidox.AcidSystemReady..Acid System Ready
SX07 = D..ABFIL1.SignalFILFromCHE1.Unidox.AcidValveOpen..Acid Valve Open
SX08 = D..ABFIL1.SignalFILFromCHE1.Unidox.PeraceticSystemReady..Peracetic System Ready
SX09 = D..ABFIL1.SignalFILFromCHE1.Unidox.PeraceticValveOpen..Peracetic Valve Open
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..Unidox
DX02 = D..ABFIL1.SignalFILToCHE1.Unidox.HearBit..Communication Check
DX03 = 
DX04 = D..ABFIL1.SignalFILToCHE1.Unidox.CausticRequest..Caustic Request
DX05 = D..ABFIL1.SignalFILToCHE1.Unidox.CausticValveOpen..Caustic Valve Open
DX06 = D..ABFIL1.SignalFILToCHE1.Unidox.AcidRequest..Acid Request
DX07 = D..ABFIL1.SignalFILToCHE1.Unidox.AcidValveOpen..Acid Valve Open
DX08 = D..ABFIL1.SignalFILToCHE1.Unidox.PeraceticRequest..Peracetic Request
DX09 = D..ABFIL1.SignalFILToCHE1.Unidox.PeraceticValveOpen..Peracetic Valve Open
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = A..ABFIL1.SignalFILToCHE1.PeraceticPumpReference..Peracetic Pump Reference..SPDP..K1
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

[CHE1_2]
;CHEMICAL <--> 	Unitherm

SX01 = B..Chemical Unitherm
SX02 = D..ABFIL1.SignalFILFromCHE1.Unitherm.HearBit..Communication Check
SX03 = 
SX04 = D..ABFIL1.SignalFILFromCHE1.Unitherm.CausticSystemReady..Caustic System Ready                 
SX05 = D..ABFIL1.SignalFILFromCHE1.Unitherm.CausticValveOpen..Caustic Valve Open
SX06 = D..ABFIL1.SignalFILFromCHE1.Unitherm.AcidSystemReady..Acid System Ready
SX07 = D..ABFIL1.SignalFILFromCHE1.Unitherm.AcidValveOpen..Acid Valve Open
SX08 = D..ABFIL1.SignalFILFromCHE1.Unitherm.PeraceticSystemReady..Peracetic System Ready
SX09 = D..ABFIL1.SignalFILFromCHE1.Unitherm.PeraceticValveOpen..Peracetic Valve Open
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..Unitherm
DX02 = D..ABFIL1.SignalFILToCHE1.Unitherm.HearBit..Communication Check
DX03 = 
DX04 = D..ABFIL1.SignalFILToCHE1.Unitherm.CausticRequest..Caustic Request
DX05 = D..ABFIL1.SignalFILToCHE1.Unitherm.CausticValveOpen..Caustic Valve Open
DX06 = D..ABFIL1.SignalFILToCHE1.Unitherm.AcidRequest..Acid Request
DX07 = D..ABFIL1.SignalFILToCHE1.Unitherm.AcidValveOpen..Acid Valve Open
DX08 = D..ABFIL1.SignalFILToCHE1.Unitherm.PeraceticRequest..Peracetic Request
DX09 = D..ABFIL1.SignalFILToCHE1.Unitherm.PeraceticValveOpen..Peracetic Valve Open
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


[CHE1_3]
;CHEMICAL <--> 	Uniclean

SX01 = B..Chemical Uniclean
SX02 = D..ABFIL1.SignalFILFromCHE1.Uniclean.HearBit..Communication Check
SX03 = 
SX04 = D..ABFIL1.SignalFILFromCHE1.Uniclean.CausticSystemReady..Caustic System Ready                 
SX05 = D..ABFIL1.SignalFILFromCHE1.Uniclean.CausticValveOpen..Caustic Valve Open
SX06 = D..ABFIL1.SignalFILFromCHE1.Uniclean.AcidSystemReady..Acid System Ready
SX07 = D..ABFIL1.SignalFILFromCHE1.Uniclean.AcidValveOpen..Acid Valve Open
SX08 = D..ABFIL1.SignalFILFromCHE1.Uniclean.PeraceticSystemReady..Peracetic System Ready
SX09 = D..ABFIL1.SignalFILFromCHE1.Uniclean.PeraceticValveOpen..Peracetic Valve Open
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..Uniclean
DX02 = D..ABFIL1.SignalFILToCHE1.Uniclean.HearBit..Communication Check
DX03 = 
DX04 = D..ABFIL1.SignalFILToCHE1.Uniclean.CausticRequest..Caustic Request
DX05 = D..ABFIL1.SignalFILToCHE1.Uniclean.CausticValveOpen..Caustic Valve Open
DX06 = D..ABFIL1.SignalFILToCHE1.Uniclean.AcidRequest..Acid Request
DX07 = D..ABFIL1.SignalFILToCHE1.Uniclean.AcidValveOpen..Acid Valve Open
DX08 = D..ABFIL1.SignalFILToCHE1.Uniclean.PeraceticRequest..Peracetic Request
DX09 = D..ABFIL1.SignalFILToCHE1.Uniclean.PeraceticValveOpen..Peracetic Valve Open
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 =
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


[CHE1_4]
;CHEMICAL <--> 	Filler

SX01 = B..Chemical Filler
SX02 = D..ABFIL1.SignalFILFromCHE1.Filler.HearBit..Communication Check
SX03 = 
SX04 = D..ABFIL1.SignalFILFromCHE1.Filler.CausticSystemReady..Caustic System Ready                 
SX05 = D..ABFIL1.SignalFILFromCHE1.Filler.CausticValveOpen..Caustic Valve Open
SX06 = D..ABFIL1.SignalFILFromCHE1.Filler.AcidSystemReady..Acid System Ready
SX07 = D..ABFIL1.SignalFILFromCHE1.Filler.AcidValveOpen..Acid Valve Open
SX08 = D..ABFIL1.SignalFILFromCHE1.Filler.PeraceticSystemReady..Peracetic System Ready
SX09 = D..ABFIL1.SignalFILFromCHE1.Filler.PeraceticValveOpen..Peracetic Valve Open
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..Filler
DX02 = D..ABFIL1.SignalFILToCHE1.Filler.HearBit..Communication Check
DX03 = 
DX04 = D..ABFIL1.SignalFILToCHE1.Filler.CausticRequest..Caustic Request
DX05 = D..ABFIL1.SignalFILToCHE1.Filler.CausticValveOpen..Caustic Valve Open
DX06 = D..ABFIL1.SignalFILToCHE1.Filler.AcidRequest..Acid Request
DX07 = D..ABFIL1.SignalFILToCHE1.Filler.AcidValveOpen..Acid Valve Open
DX08 = D..ABFIL1.SignalFILToCHE1.Filler.PeraceticRequest..Peracetic Request
DX09 = D..ABFIL1.SignalFILToCHE1.Filler.PeraceticValveOpen..Peracetic Valve Open
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************


;*************************************************


[ISO_1]
;Clean Room

SX01 = B..ISOLATOR
SX02 = D..ABFIL1.SignalFILFromISO.CriticalAlarm..Critical Alarm
SX03 = D..ABFIL1.SignalFILFromISO.MachineRunning..Machine Running
SX04 = D..ABFIL1.SignalFILFromISO.BottInletStopReq..Bott Inlet Stop Req
SX05 = D..ABFIL1.SignalFILFromISO.SterCycleFailed..Ster Cycle Failed
SX06 = D..ABFIL1.SignalFILFromISO.ReadySterilCondition..Ready Steril Condition
SX07 = D..ABFIL1.SignalFILFromISO.LossSterilityRecoverable..Loss Sterility Recoverable
SX08 = D..ABFIL1.SignalFILFromISO.LossSterilityNotRecoverable..Loss Sterility Not Recoverable
SX09 = D..ABFIL1.SignalFILFromISO.AllMotorAuto..All MotorAuto
SX10 = D..ABFIL1.SignalFILFromISO.AllDamperAuto..All DamperAuto
SX11 = D..ABFIL1.SignalFILFromISO.FilterSterSystemReady..Filter  SterSystem Ready
SX12 = D..ABFIL1.SignalFILFromISO.FilterSterSystemRunning..Filter  SterSystem Running
SX13 = D..ABFIL1.SignalFILFromISO.SETGrayZoneChangeOverReached..S E T Gray Zone Change Over Reached
SX14 = D..ABFIL1.SignalFILFromISO.ExhausterRunning..Exhauster Running
SX15 = N..ABFIL1.SignalFILFromISO.GeneralStatus..General Status
SX16 =
SX17 =
SX18 =
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToISO.CriticalAlarm..Critical Alarm
DX03 = D..ABFIL1.SignalFILToISO.AlarmModeChange..Alarm Mode Change
DX04 = D..ABFIL1.SignalFILToISO.AlarmReset..Alarm Reset
DX05 = D..ABFIL1.SignalFILToISO.NoBottlesInside..No Bottles Inside
DX06 = D..ABFIL1.SignalFILToISO.SanitationReq..Sanitation Req
DX07 = D..ABFIL1.SignalFILToISO.StandByReq..Stand By Req
DX08 = N..ABFIL1.SignalFILToISO.SC1ProdReq..S C1 Prod Req
DX09 = N..ABFIL1.SignalFILToISO.SC1ProdBMMNoSterileReq..S C1 Prod B  MM NoSterile Req
DX10 = D..ABFIL1.SignalFILToISO.SterilizationReq..Sterilization Req
DX11 = D..ABFIL1.SignalFILToISO.SterilityLossReq..Sterility Loss Req
DX12 = D..ABFIL1.SignalFILToISO.SterilityCheckEnable..Sterility Check Enable
DX13 = D..ABFIL1.SignalFILToISO.SanitationDone..Sanitation Done
DX14 = D..ABFIL1.SignalFILToISO.ProductionRunning..Production Running
DX15 = D..ABFIL1.SignalFILToISO.SanitationActive..Sanitation Active
DX16 = D..ABFIL1.SignalFILToISO.SanitationCycleActive..Sanitation Cycle Active
DX17 = D..ABFIL1.SignalFILToISO.SterilizerCarterOpen..Sterilizer Carter Open
DX18 = D..ABFIL1.SignalFILToISO.BlocCarterOpen..Bloc Carter Open
DX19 = D..ABFIL1.SignalFILToISO.FDAEnable..FDA Enable
DX20 = D..ABFIL1.SignalFILToISO.LAEnable..LA Enable
DX21 = D..ABFIL1.SignalFILToISO.HAEnable..HA Enable
DX22 = D..ABFIL1.SignalFILToISO.ESLEnable..ESL Enable
DX23 = D..ABFIL1.SignalFILToISO.NOAsepticProdEnable..NO Aseptic Prod Enable
DX24 = D..ABFIL1.SignalFILToISO.NOAsepticWaterEnable..NO Aseptic Water Enable
DX25 = D..ABFIL1.SignalFILToISO.HEPAFilterAlarmEnable..HEPA FilterAlarmEnable
DX26 = N..ABFIL1.SignalFILToISO.BMMEnable..BMM Enable
DX27 = D..ABFIL1.SignalFILToISO.AirBlowerHeatingEnable..Air Blower Heating Enable
DX28 = N..ABFIL1.SignalFILToISO.OffCJ1DA63..Off C J1 D A63

;*************************************************

;*************************************************

[SCR_1]
;scrubber

SX01 = B..SCRUBBER
SX02 = D..ABFIL1.SignalFILFromSCR.ComCheck.AreYouThere..Communication Check – Request to Partner
SX03 = D..ABFIL1.SignalFILFromSCR.ComCheck.YesImOK..Communication Check – Reply to Partner
SX04 =                  
SX05 = D..ABFIL1.SignalFILFromSCR.CriticalAlarm..Critical Alarm (1=OK) 
SX06 = D..ABFIL1.SignalFILFromSCR.CriticalWarning..Critical Warning 
SX07 = D..ABFIL1.SignalFILFromSCR.Running..Scrubber running
SX08 = D..ABFIL1.SignalFILFromSCR.ParameterInRange..Parameters in range
SX09 = D..ABFIL1.SignalFILFromSCR.CausticRequest..Caustic Request
SX10 = D..ABFIL1.SignalFILFromSCR.BisulphiteRequest..Bisulphite Request
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 =
SX16 =
SX17 =
SX18 =
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 




DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToSCR.ComCheck.AreYouThere..Communication Check – Request to Partner
DX03 = D..ABFIL1.SignalFILToSCR.ComCheck.YesImOk..Communication Check – Reply to Partner
DX04 = 
DX05 = D..ABFIL1.SignalFILToSCR.CriticalAlarm..Critical Alarm (1=OK)
DX06 = D..ABFIL1.SignalFILToISO.AlarmReset..Alarm reset request
DX07 = D..ABFIL1.SignalFILToSCR.StartRequest..Scrubber start request
DX08 = 
DX09 = D..ABFIL1.SignalFILToSCR.CausticAvailable..Caustic Available
DX10 = D..ABFIL1.SignalFILToSCR.BisulphiteAvailable..Bisulphite Available
DX11 = 
DX12 = 
DX13 =
DX14 =
DX15 =
DX16 =
DX17 =
DX18 = 
DX19 =
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************

[CHK_1]
;CHECKSTAR

SX01 = B..CHECKSTAR
SX02 = 
SX03 =
SX04 = D..ABFIL1.In_CheckStar.ConvCalibration_001.0..Conveyors calibration request
SX05 = D..ABFIL1.In_CheckStar.Warning_007.14..Continuous reject
SX06 = 
SX07 = D..ABFIL1.In_CheckStar.Warning_008.0..High level control disabled
SX08 = D..ABFIL1.In_CheckStar.Warning_008.1..Low level control disabled 
SX09 = D..ABFIL1.In_CheckStar.Warning_008.4..Caps seal control disabled 
SX10 = D..ABFIL1.In_CheckStar.Warning_008.5..Cork caps control disabled 
SX11 = D..ABFIL1.In_CheckStar.Warning_008.6..Caps presence control disabled 
SX12 = D..ABFIL1.In_CheckStar.Warning_008.7..Inspection not possible control disabled 
SX13 = D..ABFIL1.In_CheckStar.Warning_008.8..Manual continuos rejection control disabled 
SX14 = D..ABFIL1.In_CheckStar.Warning_008.13..Bottles too close control disabled 
SX15 = D..ABFIL1.In_CheckStar.Warning_008.14..Rejection from filler disabled 
SX16 = D..ABFIL1.In_CheckStar.Warning_008.15..Rejection from capper disabled 
SX17 = D..ABFIL1.In_CheckStar.Warning_009.0..Impulsive rejector manual stop condition 
SX18 = D..ABFIL1.In_CheckStar.Warning_009.2..Progressive rejector manual stop condition 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.Out_CheckStar.Signals_000.1..Communication Check
DX03 = D..ABFIL1.Out_CheckStar.Signals_000.2..Conveyor running 
DX04 = D..ABFIL1.Out_CheckStar.Signals_000.4..Conveyors calibration enable 
DX05 = D..ABFIL1.PROGRAM:FILLER.Out_XC16_ToCheckstarRejectStep..Request Rejection
DX06 = 
DX07 = 
DX08 =
DX09 =
DX10 =
DX11 =
DX12 =
DX13 =
DX14 =
DX15 =
DX16 =
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


[CHK_2]
;CHECKSTAR
SX01 = B..CHECKSTAR
SX02 = 
SX03 = D..ABFIL1.In_CheckStar.Alarm_004.12..Level Sensor Problem
SX04 = D..ABFIL1.In_CheckStar.Alarm_004.13..Continuos Label Rejection
SX05 = D..ABFIL1.In_CheckStar.Alarm_004.14..Conveyor Calibration Running
SX06 = D..ABFIL1.In_CheckStar.Alarm_004.15..Continuos Label Rejection
SX07 = D..ABFIL1.In_CheckStar.Alarm_004.5..Camera 1 not Working
SX08 = D..ABFIL1.In_CheckStar.Alarm_004.6..Camera 2 not Working
SX09 = D..ABFIL1.In_CheckStar.FCAnomaly_000.8..Exit Starwheel Photoeye Anomaly (FC0.1)
SX10 = D..ABFIL1.In_CheckStar.FCAnomaly_000.9..Tunnel Outlet Conveyor Photoeye Anomaly (FC1.2)
SX11 = D..ABFIL1.In_CheckStar.FCAnomaly_000.10..Photoeye Anomaly (FC2.2)
SX12 = D..ABFIL1.In_CheckStar.FCAnomaly_000.11..Photoeye Anomaly (FC3.2)
SX13 = D..ABFIL1.In_CheckStar.FCAnomaly_000.12..Photoeye Anomaly (FC4.2)
SX14 = D..ABFIL1.In_CheckStar.FCAnomaly_000.13..Photoeye Anomaly (FC5.2)
SX15 = D..ABFIL1.In_CheckStar.FCAnomaly_000.14..Photoeye Anomaly (FC6.2)
SX16 = D..ABFIL1.In_CheckStar.FCAnomaly_000.15..Checkstar Photoeye Anomaly 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER B..CHECKSTAR
DX02 = 
DX03 = 
DX04 = 
DX05 = D..ABFIL1.Out_CheckStar.Signals_000.2..Conveyor running 
DX06 = D..ABFIL1.Out_CheckStar.Signals_000.2..Conveyor running
DX07 = D..ABFIL1.Out_CheckStar.Signals_000.3..Filler running
DX08 = D..ABFIL1.Out_CheckStar.Signals_000.4..Conveyor calibrationRequest
DX09 = D..ABFIL1.Out_CheckStar.Signals_000.5..Calibration Syncro Conveyor Running
DX10 = D..ABFIL1.Out_CheckStar.Signals_000.6..Bottles in capping zone
DX11 = D..ABFIL1.Out_CheckStar.Signals_001.0..Bottles Counter Reset from Remote
DX12 = D..ABFIL1.Out_CheckStar.Signals_001.1..Label Counter Reset from Remote
DX13 = D..ABFIL1.Out_CheckStar.Signals_001.3..Filler to Checkstar Continuous Reject Request
DX14 = 
DX15 = D..ABFIL1.Out_CheckStar.Signals_001.4..Continuos reject Label 1
DX16 = D..ABFIL1.Out_CheckStar.Signals_001.5..Continuos reject Label 2 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************
;*************************************************


[CFT_1]
;FT

SX01 = B..BOTTLE INSPECTOR FT SYSTEM
SX02 = D..ABFIL1.SignalFILFromBFT.MachineReady..Machine Ready
SX03 = 
SX04 = D..ABFIL1.SignalFILFromBFT.ContinuousReject..Continuous Reject 
SX05 = N..ABFIL1.SignalFILFromBFT.SqueezerRunning..SqueezerRunning
SX06 = D..ABFIL1.SignalFILFromBFT.AlarmHighPriority..Alarm High Priority
SX07 = D..ABFIL1.SignalFILFromBFT.AlarmLowPriority..Alarm Low Priority
SX08 = N..ABFIL1.SignalFILFromBFT.RayXEnabled..RayXEnabled
SX09 = A..ABFIL1.SignalFILFromFTB.Word_43722_Total_Inspected..Total Inspected..CNTR..K1
SX10 = A..ABFIL1.SignalFILFromFTB.Word_43724_Capper..Capper..CNTR..K1
SX11 = A..ABFIL1.SignalFILFromFTB.Word_43726_Nitrogen..Nitrogen..CNTR..K1
SX12 = A..ABFIL1.SignalFILFromFTB.Word_43728_Filler_Sterility_And_Anomaly..Not aseptic or anomaly from Filler..CNTR..K1
SX13 = A..ABFIL1.SignalFILFromFTB.Word_43730_Minimum_Level..Minimum Livel..CNTR..K1
SX14 = A..ABFIL1.SignalFILFromFTB.Word_43732_Maximum_Level..Maximum Level..CNTR..K1
SX15 = A..ABFIL1.SignalFILFromFTB.Word_43734_Security_Ring..Security Ring..CNTR..K1
SX16 = A..ABFIL1.SignalFILFromFTB.Word_43736_CapPosition_Missing_Anomaly..Cap Position/Missing/Anomaly..CNTR..K1
SX17 = A..ABFIL1.SignalFILFromFTB.Word_43738_Cap_Position..Cap Position..CNTR..K1
SX18 = A..ABFIL1.SignalFILFromFTB.Word_43740_Cap_Missing..Cap Missing..CNTR..K1
SX19 = A..ABFIL1.SignalFILFromFTB.Word_43742_Cap_Anomaly..Cap Anomaly..CNTR..K1
SX20 = A..ABFIL1.SignalFILFromFTB.Word_43744_Cap_Color..Cap Color..CNTR..K1
SX21 = A..ABFIL1.SignalFILFromFTB.Word_43746_Cap_BrandLogo..Cap Brand/logo Cap..CNTR..K1
SX22 = A..ABFIL1.SignalFILFromFTB.Word_43748_Code_Inspection..Code Inspection..CNTR..K1
SX23 = A..ABFIL1.SignalFILFromFTB.Word_43750_Foil_Inspection..Foil Inspection..CNTR
SX24 = A..ABFIL1.SignalFILFromFTB.Word_43752_Squeezer_Minumum_Level..Squeezer Minumum Level..CNTR..K1
SX25 = A..ABFIL1.SignalFILFromFTB.Word_43754_Squeezer_Maximum_Level..Squeezer Maximum Level..CNTR..K1
SX26 = A..ABFIL1.SignalFILFromFTB.Word_43760_Not_Inspectables..Not Inspectables..CNTR..K1
SX27 = A..ABFIL1.SignalFILFromFTB.Word_43762_Too_Close..Too Close..CNTR..K1
SX28 = D..ABFIL1.SignalFILFromBFT.Alarm..Alarm (1=OK) 


DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToBFT.BlowerFillerSincronized..Blower Filler Sincronized
DX03 = 
DX04 = D..ABFIL1.SignalFILToBFT.StepByStepReject..Step By Step Reject 
DX05 = D..ABFIL1.SignalFILToBFT.ContinuousReject..Continuous Reject
DX06 = 
DX07 = 
DX08 = 
DX09 =
DX10 =
DX11 =
DX12 =
DX13 =
DX14 =
DX15 =
DX16 =
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = D..ABFIL1.SignalFILToBFT.Alarm..Alarm (1=OK) 


[CFT_2]
;FT
SX01 = B..BOTTLE INSPECTOR FT SYSTEM
SX02 = A..ABFIL1.SignalFILFromFTB.Word_43764_Other_Reasons..Other Reasons..CNTR..K1
SX03 = A..ABFIL1.SignalFILFromFTB.Word_43766_Sampled..Sampled..CNTR
SX04 = A..ABFIL1.SignalFILFromFTB.Word_43768_Total_Inspected_Labeller1..Total Inspected Labeller1..CNTR
SX05 = A..ABFIL1.SignalFILFromFTB.Word_43770_Label_Anomaly_Labeller1..Label Anomaly Labeller1..CNTR..K1
SX06 = A..ABFIL1.SignalFILFromFTB.Word_43772_Code_Inspection_Labeller1..Code Inspection Labeller1..CNTR
SX07 = A..ABFIL1.SignalFILFromFTB.Word_43774_Other_Reasons_Labeller1..Other Reasons Labeller1..CNTR..K1
SX08 = A..ABFIL1.SignalFILFromFTB.Word_43776_Total_Inspected_Labeller2..Total Inspected Labeller2..CNTR
SX09 = A..ABFIL1.SignalFILFromFTB.Word_43778_Label_Anomaly_Labeller2..Label Anomaly Labeller2..CNTR..K1
SX10 = A..ABFIL1.SignalFILFromFTB.Word_43780_Code_Inspection_Labeller2..Code Inspection Labeller2..CNTR
SX11 = A..ABFIL1.SignalFILFromFTB.Word_43782_Other_Reasons_Labeller2..Other Reasons Labeller2..CNTR..K1
SX12 = 
SX13 = 
SX14 = 
SX15 =  
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = 
DX03 = 
DX04 = 
DX05 = 
DX06 = 
DX07 = 
DX08 = 
DX09 =
DX10 =
DX11 =
DX12 =
DX13 =
DX14 =
DX15 =
DX16 =
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************
;*************************************************


[BOT_1]
;BOTTLE ISPECTOR

SX01 = B..BOTTLE ISPECTOR
SX02 = D..ABFIL1.SignalFILFromBOT.ComCheck.AreYouThere..Communication Check – Request to Partner
SX03 = D..ABFIL1.SignalFILFromBOT.ComCheck.YesImOK..Communication Check – Reply to Partner
SX04 = 
SX05 = D..ABFIL1.SignalFILFromBOT.Alarm..Alarm (1=OK) 
SX06 = D..ABFIL1.SignalFILFromBOT.ContinuousReject..Continuous Reject 
SX07 = 
SX08 = 
SX09 =  
SX10 = 
SX11 = 
SX12 = 
SX13 =  
SX14 = 
SX15 =  
SX16 = 
SX17 = 
SX18 =  
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..BOTTLE ISPECTOR
DX02 = D..ABFIL1.SignalFILToBOT.ComCheck.AreYouThere..Communication Check – Request to Partner
DX03 = D..ABFIL1.SignalFILToBOT.ComCheck.YesImOk..Communication Check – Reply to Partner
DX04 = 
DX05 = D..ABFIL1.SignalFILToBOT.Alarm..Alarm (1=OK) 
DX06 = D..ABFIL1.SignalFILToBOT.StepByStepReject..Step By Step Reject 
DX07 = D..ABFIL1.SignalFILToBOT.ContinuousReject..Continuous Reject
DX08 =
DX09 =
DX10 =
DX11 =
DX12 =
DX13 =
DX14 =
DX15 =
DX16 =
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************
;*************************************************


[UTP_1]
;Product Supplier

SX01 = B..PRODUCT SUPPLIER
SX02 = 
SX03 = 
SX04 = 
SX05 = D..ABFIL1.SignalFILFromUTP.CriticalAlarm..Critical Alarm (1=OK)
SX06 = D..ABFIL1.SignalFILFromUTP.ProdReady..Product Ready
SX07 = D..ABFIL1.SignalFILFromUTP.Sterile..Sterilization Ready
SX08 = D..ABFIL1.SignalFILFromUTP.EndProduction..End Production
SX09 = D..ABFIL1.SignalFILFromUTP.ATankCIPActive..Product Line CIP Active
SX10 = D..ABFIL1.SignalFILFromUTP.ATankSIPACtive..Product Line SIP Active
SX11 = D..ABFIL1.SignalFILFromUTP.Flush4WayVlvReq..4 Way Valve Fluxing Request
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = A..ABFIL1.SignalFILFromUTP.ActiveTankWeight..Product Tank Weight..WGTK..K1
SX19 = A..ABFIL1.SignalFILFromUTP.ActiveTankPress..Product Tank Pressure..PRSM..K1
SX20 =
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = 
DX03 = 
DX04 = 
DX05 = D..ABFIL1.SignalFILToUTP.CriticalAlarm..Critical Alarm (1=OK)
DX06 = D..ABFIL1.SignalFILToUTP.ProductRequest..Product Request
DX07 = D..ABFIL1.SignalFILToUTP.Sterile..Product line in sterile condition
DX08 = D..ABFIL1.SignalFILToUTP.Prod4WayVlvOpen..4 Way Valve Open
DX09 = D..ABFIL1.SignalFILToUTP.ProdModVlvOpen..Modulating Valve Open
DX10 = D..ABFIL1.SignalFILToUTP.Prod4WayVlvSIPActOrSterile..4 way valve SIP active or Sterile
DX11 = N..ABFIL1.SignalFILToUTP.SteamAvailable..Steam Available
DX12 = N..ABFIL1.SignalFILToUTP.LossSterilityRequest..Lost Sterility Request
DX13 = N..ABFIL1.SignalFILToUTP.UPSWorkingBattery..UPS Working On Battery
DX14 = N..ABFIL1.SignalFILToUTP.UPSEndOfBatteryAlarm..UPS End Of Battery Alarm
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

[UFA_1]
;Product Pastorizer

SX01 = B..PRODUCT PASTORIZER
SX02 = 
SX03 = 
SX04 = 
SX05 = D..ABFIL1.SignalFILFromUFA.ProductReady..Product Ready
SX06 =N..ABFIL1.SignalFILFromUFA.Flush4WayVlvReq..Flush 4Way Valve Request
SX07 = D..ABFIL1.SignalFILFromUFA.EndProduction..Production End
SX08 = D..ABFIL1.SignalFILFromUFA.TankSterile..Aseptic Tank Sterile
SX09 =N..ABFIL1.SignalFILFromUFA.ProdLineSipReq..Prod LineSip 
SX10 =N..ABFIL1.SignalFILFromUFA.ProdLineSipAct..Prod Line Sip Active
SX11 =N..ABFIL1.SignalFILFromUFA.ProdLineCipReq..Prod Line Cip 
SX12 = D..ABFIL1.SignalFILFromUFA.ProdLineCipAct..Prod Line Cip Active
SX13 = D..ABFIL1.SignalFILFromUFA.PreSterilizingAct..PreSterilizing Active
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = A..ABFIL1.SignalFILFromUFA.ActiveTankWeight..Product tank weight..WGTK..K1
SX19 = A..ABFIL1.SignalFILFromUFA.ActiveTankPressure..Product tank pressure..PRSM..K1
SX20 = D..ABFIL1.SignalFILFromUFA.CriticalAlarm..Critical Alarm (1=OK)
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = 
DX03 = 
DX04 =
DX05 = D..ABFIL1.SignalFILToUFA.ProductRequest..Product request
DX06 = D..ABFIL1.SignalFILToUFA.ProductActive..Production Active
DX07 = D..ABFIL1.SignalFILToUFA.Prod4WayVlvOpen..4Way Valve (CI1VPG02) Open
DX08 = D..ABFIL1.SignalFILToUFA.Flush4WayVlvDone..Flush4 Way Valve Done
DX09 = D..ABFIL1.SignalFILToUFA.Valve4waysterile..4 Way Valve sterile
DX10 = D..ABFIL1.SignalFILToUFA.ProdModVlvOpen..Modulating Valve (CI1VPG53) open state
DX11 =N..ABFIL1.SignalFILToUFA.LossSterilityRequest..Loss Of Sterility By Steam Barrier(CI1VPG02)
DX12 =D..ABFIL1.SignalFILToUFA.CipAllowed..CIP Allowed
DX13 =D..ABFIL1.SignalFILToUFA.SipAllowed..SIP Allowed   
DX14 =N..ABFIL1.SignalFILToUFA.CIP_ReadyToSanitation..Filler Ready to Sanitation           
DX15 = 
DX16 =N..ABFIL1.SignalFILToUFA.UPSNormalOperation..UPS in Operation
DX17 = D..ABFIL1.SignalFILToUFA.UPSWorkingBattery..UPS working with battery
DX18 = D..ABFIL1.SignalFILToUFA.UPSEndOfBatteryAlarm..UPS end of battery ALARM
DX19 = 
DX20 = D..ABFIL1.SignalFILToUFA.CriticalAlarm..Critical Alarm (1=OK)
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

[UFA_2]
;Product Pastorizer Sanitation

SX01 = B..PRODUCT PASTORIZER sanitation
SX02 = N..ABFIL1.SignalFILFromUFA.ComCheck.AreYouThere..Communication Check – Request to Partner
SX03 = N..ABFIL1.SignalFILFromUFA.ComCheck.YesImOk..Communication Check – Reply to Partner
SX04 = 
SX05 = 
SX06 = 
SX07 = 
SX08 = 
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = D..ABFIL1.SignalFILFromUFA.CIP_InletValveOpen..CIP Inlet valve open
SX14 = D..ABFIL1.SignalFILFromUFA.CIP_CriticalAlarm..CIP Critical Alarm
SX15 = D..ABFIL1.SignalFILFromUFA.CIP_ReturnValveOpen..CIP Outlet valve open
SX16 = D..ABFIL1.SignalFILFromUFA.CIP_SanitationRequest..CIP Sanitation request
SX17 = D..ABFIL1.SignalFILFromUFA.CIP_ProductChangeOverEnd..CIP Change over phase done
SX18 = D..ABFIL1.SignalFILFromUFA.CIP_DrainEnd..CIP Drain phase done 
SX19 = D..ABFIL1.SignalFILFromUFA.CIP_ResetCycle..CIP Cycle Reset
SX20 = D..ABFIL1.SignalFILFromUFA.CriticalAlarm..Critical Alarm (1=OK)
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER sanitation
DX02 = N..ABFIL1.SignalFILToUFA.ComCheck.AreYouThere..Communication Check – Request to Partner
DX03 = N..ABFIL1.SignalFILToUFA.ComCheck.YesImOk..Communication Check – Reply to Partner
DX04 = 
DX05 = D..ABFIL1.SignalFILToUFA.CipActive..Filler CIP Active
DX06 = D..ABFIL1.SignalFILToUFA.CipAllowed..CIP Enable
DX07 = 
DX08 = D..ABFIL1.SignalFILToUFA.SteamAvailable..Steam Available
DX09 = D..ABFIL1.SignalFILToUFA.SipActive..Filler SIP Active
DX10 = D..ABFIL1.SignalFILToUFA.SipAllowed..SIP Enable to Pastorizer
DX11 = D..ABFIL1.SignalFILToUFA.Flush4WayVlvDone..4Way Valve (CI1VPG02) Flowing seat done
DX12 = D..ABFIL1.SignalFILToUFA.LossSterilityRequest..Loss Of Sterility By Steam Barrier(CI1VPG02) 
DX13 = 
DX14 = D..ABFIL1.SignalFILToUFA.CIP_CriticalAlarm..CIP unit Critical Alarm
DX15 = D..ABFIL1.SignalFILToUFA.CIP_ReadyToSanitation..CIP unit Ready to sanitation
DX16 = D..ABFIL1.SignalFILToUFA.CIP_SanitationAgentSend..CIP unit Sanitation agent send
DX17 = D..ABFIL1.SignalFILToUFA.CIP_ProductChangeOverReq..CIP unit Change over phase
DX18 = D..ABFIL1.SignalFILToUFA.CIP_DrainReq..CIP unit Drain phase
DX19 = D..ABFIL1.SignalFILToUFA.CIP_EndSanitation..CIP unit End sanitation phase
DX20 = D..ABFIL1.SignalFILToUFA.CriticalAlarm..Critical Alarm (1=OK)
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************

[UFA_3]
;Product Pastorizer Cip

SX01 = B..PRODUCT PASTORIZER Cip
SX02 = D..ABFIL1.SignalFILFromUFA.FromCIP_CriticalAlarm..Critical Alarm (1=OK)
SX03 = D..ABFIL1.SignalFILFromUFA.FromCIP_CleaningAgendSending..Cleaning Agend Sending
SX04 = D..ABFIL1.SignalFILFromUFA.FromCIP_ProductChangeOverReq..Product Change Over Req
SX05 = D..ABFIL1.SignalFILFromUFA.FromCIP_ProductDrainageReq..Product Drainage Req
SX06 = D..ABFIL1.SignalFILFromUFA.FromCIP_PreRinseRunning..Pre Rinse Running
SX07 = D..ABFIL1.SignalFILFromUFA.FromCIP_EndSanitation..End Sanitation
SX08 = D..ABFIL1.SignalFILFromUFA.FromCIP_ToChemicalsCausticReq..To Chemicals Caustic Req
SX09 = D..ABFIL1.SignalFILFromUFA.FromCIP_ToChemicalsCausticValveOpen..To Chemicals Caustic Valve Open
SX10 = D..ABFIL1.SignalFILFromUFA.FromCIP_ToChemicalsAcidReq..To Chemicals Acid Req
SX11 = D..ABFIL1.SignalFILFromUFA.FromCIP_ToChemicalsAcidValveOpen..To Chemicals Acid Valve Open
SX12 = D..ABFIL1.SignalFILFromUFA.FromCIP_ToChemicalsPeraceticReq..To Chemicals Peracetic Req
SX13 = D..ABFIL1.SignalFILFromUFA.FromCIP_ToChemicalsPeraceticValveOpen..To Chemicals Peracetic Valve Open
SX14 = A..ABFIL1.SignalFILFromUFA.FromCIP_PhaseRunning..Phase Running..CNTR..K1
SX15 = A..ABFIL1.SignalFILFromUFA.FromCIP_PhaseTimeCoundown..Phase Time Coundown..TIME..K1
SX16 = A..ABFIL1.SignalFILFromUFA.FromCIP_CleaningAgentSendTemp..Cleaning Agent Send Temp..TEMP..K1
SX17 = A..ABFIL1.SignalFILFromUFA.FromCIP_CleaningAgentReturnTemp..Cleaning Agent Return Temp..TEMP..K1
SX18 = A..ABFIL1.SignalFILFromUFA.FromCIP_Conducibility..Conducibility..LVLT..K1
SX19 = A..ABFIL1.SignalFILFromUFA.FromCIP_SendingFlowRate..Sending FlowRate..FLWL..K1
SX20 = A..ABFIL1.SignalFILFromUFA.FromCIP_RemainingTimePerc..Remaining Time Perc..TIME..K1
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER Cip sanitation
DX02 = D..ABFIL1.SignalFILToUFA.ToCIP_Alarm..Critical Alarm (1=OK)
DX03 = D..ABFIL1.SignalFILToUFA.ToCIP_ReadyToSanitation..Ready To Sanitation
DX04 = D..ABFIL1.SignalFILToUFA.ToCIP_ChangeProductEnd..Change Product End
DX05 = D..ABFIL1.SignalFILToUFA.ToCIP_DrainageEnd..Drainage End
DX06 = D..ABFIL1.SignalFILToUFA.ToCIP_InletValveOpen..Inlet Valve Open
DX07 = D..ABFIL1.SignalFILToUFA.ToCIP_ReturnValveOpen..Return Valve Open
DX08 = D..ABFIL1.SignalFILToUFA.ToCIP_SanitationStart..Sanitation Start
DX09 = D..ABFIL1.SignalFILToUFA.ToCIP_SanitationEndConfirm..Sanitation End Confirm
DX10 = D..ABFIL1.SignalFILToUFA.ToCIP_CycleFailed..CycleFailed
DX11 = D..ABFIL1.SignalFILToUFA.ToCIP_SelectionOnFiller..Selection On Filler
DX12 = D..ABFIL1.SignalFILToUFA.ToCIP_FromChemicalsCausticSistemReady..From Chemicals Caustic Sistem Ready
DX13 = D..ABFIL1.SignalFILToUFA.ToCIP_FromChemicalsCausticValveOpen..From Chemicals Caustic Valve Open
DX14 = D..ABFIL1.SignalFILToUFA.ToCIP_FromChemicalsAcidSistemReady..From Chemicals Acid Sistem Ready
DX15 = D..ABFIL1.SignalFILToUFA.ToCIP_FromChemicalsAcidValveOpen..From Chemicals Acid Valve Open
DX16 = D..ABFIL1.SignalFILToUFA.ToCIP_FromChemicalsPeraceticSistemReady..From Chemicals Peracetic Sistem Ready
DX17 = D..ABFIL1.SignalFILToUFA.ToCIP_FromChemicalsPeraceticValveOpen..From Chemicals Peracetic Valve Open
DX18 = A..ABFIL1.SignalFILToUFA.ToCIP_RecipeSelect..Recipe Select..CNTR..K1
DX19 = A..ABFIL1.SignalFILToUFA.ToCIP_FlowRequest..Flow Request..FLWL..K1
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 




;*************************************************

;*************************************************

[NTD_1]
;Terboven

SX01 = B..TERBOVEN
SX02 = D..ABFIL1.SignalFILFromNTD.ComCheck..Communication Check-Reply
SX03 =     
SX04 = D..ABFIL1.SignalFILFromNTD.EmptyingRunning..Emptying in Progress
SX05 = D..ABFIL1.SignalFILFromNTD.EmptyingDone..Emptying Completed
SX06 = D..ABFIL1.SignalFILFromNTD.SterilizationRunning..Sterilization in Progress
SX07 = D..ABFIL1.SignalFILFromNTD.SterilizationDone..Sterilization Completed
SX08 = 
SX09 = D..ABFIL1.SignalFILFromNTD.DosingUnitSteril..Dosing Unit Sterile
SX10 = D..ABFIL1.SignalFILFromNTD.StartupProdRunning..Start up for Production
SX11 = D..ABFIL1.SignalFILFromNTD.ReadyForProduction..Ready for Production (Start up done)
SX12 =
SX13 = 
SX14 = 
SX15 =
SX16 = 
SX17 = 
SX18 = D..ABFIL1.SignalFILFromNTD.RemoteControlEnable..Remote Control Enabled (1=Filler, 0=OP)
SX19 = D..ABFIL1.SignalFILFromNTD.Warning..Warning (1=OK)
SX20 = D..ABFIL1.SignalFILFromNTD.Alarm..Alarm (1=OK)
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = D..ABFIL1.SignalFILToNTD.ComCheck..Communication Check-Request
DX03 =
DX04 = D..ABFIL1.SignalFILToNTD.EmptyingRequest..Emptying request
DX05 = D..ABFIL1.SignalFILToNTD.SterilizationRequest..Sterilization Request
DX06 = D..ABFIL1.SignalFILToNTD.ProductionRequest..Production Request
DX07 = 
DX08 = D..ABFIL1.SignalFILToNTD.DosingHeadClosure..Dosing Head Closure
DX09 = 
DX10 = D..ABFIL1.SignalFILToNTD.SterilizationDisable..Sterilization Disable 

DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 

;*************************************************
;*************************************************

[WAF_1]
;WATER FILTRATION PROD.

SX01 = B..WATER FILTRATION PROD.
SX02 = 
SX03 = D..ABFIL1.PROGRAM:FILLER.D40_66.TKE01LevelCheck..Level TKE01 Tank check
SX04 = D..ABFIL1.PROGRAM:FILLER.D40_66.SterileWaterReady..Sterile Water Available
SX05 = D..ABFIL1.PROGRAM:FILLER.D40_66.ReadyToCooling..Ready for Cooling
SX06 = D..ABFIL1.PROGRAM:FILLER.D40_66.ReadyToRinsing..WF Production Ready for Rinsing
SX07 = D..ABFIL1.PROGRAM:FILLER.D40_66.ValveCloseForWarning..4 Way Valve clousure request for warning
SX08 = D..ABFIL1.PROGRAM:FILLER.D40_66.PrefilterClogged..Prefilter Clogged
SX09 = D..ABFIL1.PROGRAM:FILLER.D40_66.Filter1Clogged..1° Filter Clogged
SX10 = D..ABFIL1.PROGRAM:FILLER.D40_66.Filter2Clogged..2° Filter Clogged
SX11 = D..ABFIL1.PROGRAM:FILLER.D40_66.PrefilterCloggedDisable..Prefilter Clogged disable from HMI
SX12 = D..ABFIL1.PROGRAM:FILLER.D40_66.Filter1CloggedDisable..1° Filter Clogged event from HMI
SX13 = D..ABFIL1.PROGRAM:FILLER.D40_66.Filter2CloggedDisable..2° Filter Clogged event from HMI
SX14 = D..ABFIL1.PROGRAM:FILLER.D40_66.FilterCloggedHelpMemory..Filter Clogged  Help Memory
SX15 = D..ABFIL1.PROGRAM:FILLER.D40_66.StandByRamp..Standby Ramp During Filler Cooling
SX16 = D..ABFIL1.PROGRAM:FILLER.D40_66.WaterFiltrationFlow.. WF Flow (0=Low 1=High)
SX17 = D..ABFIL1.PROGRAM:FILLER.D40_66.StopWFForExCondition.0..Stop WF COP Cycle Selected
SX18 = D..ABFIL1.PROGRAM:FILLER.D40_66.StopWFForExCondition.1..Stop WF Integraty Test Cycle Selected
SX19 = D..ABFIL1.PROGRAM:FILLER.D40_66.StopWFForExCondition.2..Stop WF Clogged
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..WATER FILTRATION PROD.
DX02 =
DX03 = 
DX04 = 
DX05 = 
DX06 = 
DX07 = 
DX08 = 
DX09 = 
DX10 = 
DX11 = 
DX12 = 
DX13 = 
DX14 = 
DX15 = 
DX16 = 
DX17 = 
DX18 = A..ABFIL1.SignalFILToHmi.NumberOfWFSterilizationRemaining..Number Of WF Steriliz. Remaining..CNTR..K1
DX19 = A..ABFIL1.SignalFILToHmi.TotalHoursWFWorking..Total Hours WF Working..TIMH..K1
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************
;*************************************************

[WAF_2]
;WATER FILTRATION SANT.

SX01 = B..WATER FILTRATION SANT.
SX02 = 
SX03 = D..ABFIL1.PROGRAM:FILLER.D40_65.PAAUnitLevelCheck..Level Pure PAA Tank check
SX04 = D..ABFIL1.PROGRAM:FILLER.D40_65.TKE01LevelCheck..Level TKE01 Tank check
SX05 = D..ABFIL1.PROGRAM:FILLER.D40_65.PAAFirstDosing..PAA First Dosing Active
SX06 = D..ABFIL1.PROGRAM:FILLER.D40_65.PAAFineDosing..PAA Fine Dosing Active
SX07 = 
SX08 = D..ABFIL1.PROGRAM:FILLER.D40_65.WFSterile..System Sterile
SX09 = D..ABFIL1.PROGRAM:FILLER.D40_65.ToAnalyzerPAACheck..WF To analyzer PAA check
SX10 = D..ABFIL1.PROGRAM:FILLER.D40_65.ToAnalyzerPAAAcquisition..WF To analyzer PAA acquistition
SX11 = D..ABFIL1.PROGRAM:FILLER.D40_65.FlowingUpperSeatCI1VPW09Request..Flowing Of The Upper Seat Valve CI1VPW09 Request
SX12 = D..ABFIL1.PROGRAM:FILLER.D40_65.FlowingUpperSeatCI1VPW10Request..Flowing Of The Upper Seat Valve CI1VPW10 Request
SX13 = D..ABFIL1.PROGRAM:FILLER.D40_65.StartSecondManualDosing.. Start Second Manual Dosing
SX14 = D..ABFIL1.PROGRAM:FILLER.D40_65.ManualTritationRequest..Manual Tritation Request
SX15 = D..ABFIL1.PROGRAM:FILLER.D40_65.FinalRinsingEnabled..Final Rinsing Enabled
SX16 = D..ABFIL1.PROGRAM:FILLER.D40_65.MixingAfterDosingStart..Mixing PAA Solution After Manual Dosing
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..WATER FILTRATION SANT.
DX02 =
DX03 = 
DX04 = 
DX05 = 
DX06 = D..ABFIL1.PROGRAM:FILLER.D40_65.InitialDrainDone..Initial drain done
DX07 = 
DX08 = 
DX09 = 
DX10 = 
DX11 = D..ABFIL1.PROGRAM:FILLER.D40_65.FlowingUpperSeatCI1VPW09Done..Flowing Of The Upper Seat Valve CI1VPW09 Done
DX12 = D..ABFIL1.PROGRAM:FILLER.D40_65.FlowingUpperSeatCI1VPW10Done..Flowing Of The Upper Seat Valve CI1VPW10 Done
DX13 = D..ABFIL1.PROGRAM:FILLER.D40_65.FirstManualFineDosingDone..First Manual Fine Dosing Done
DX14 = D..ABFIL1.PROGRAM:FILLER.D40_65.ManualDosingOK..Manual Dosing OK
DX15 = D..ABFIL1.PROGRAM:FILLER.D40_65.ManualAnalysisEnabled..Manual analysis enabled
DX16 = 
DX17 = 
DX18 = 
DX19 = 
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************
;*************************************************

[BMM_1]
;SOFFIATRICE

SX01 = B..BMM
SX02 = 
SX03 = D..ABFIL1.SignalFILFromBMM.SynchroMode..Modalità abbinata 
SX04 = D..ABFIL1.SignalFILFromBMM.AlarmReset..Reset allarme                 
SX05 = D..ABFIL1.SignalFILFromBMM.AutoCycle..Ciclo automatico
SX06 = D..ABFIL1.SignalFILFromBMM.SynchroMachine..Marcia sincrona
SX07 = D..ABFIL1.SignalFILFromBMM.NotSynchroMode..Marcia non sincrona
SX08 = D..ABFIL1.SignalFILFromBMM.BlowerRotation..Rotazione soffiatrice
SX09 = D..ABFIL1.SignalFILFromBMM.BlowerEmpty..Soffiatrice vuota
SX10 = D..ABFIL1.SignalFILFromBMM.BottleGood..Bottiglia buona
SX11 = D..ABFIL1.SignalFILFromBMM.SynchroJogReq..Richiesta marcia impulsi Synchro
SX12 = 
SX13 = D..ABFIL1.SignalFILFromBMM.EmergencyOK..Emergenza OK
SX14 = D..ABFIL1.SignalFILFromBMM.DoorClose..Porte chiuse
SX15 = D..ABFIL1.SignalFILFromBMM.ReSynchroConfirm..Re Synchro Conferma
SX16 = 
SX17 = 
SX18 = 
SX19 = A..ABFIL1.SignalFILFromBMM.PreformBottlesNumber..Numero preforme..NONE..K1
SX20 = A..ABFIL1.SignalFILFromBMM.RecipeSpeed..Velocità ricetta..SPDH..K1
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = 
DX03 = D..ABFIL1.SignalFILToBMM.FillerReady..Filler Pronta
DX04 = D..ABFIL1.SignalFILToBMM.DoorClose..Porte chiuse
DX05 = D..ABFIL1.SignalFILToBMM.SyncDone..Sync fatta
DX06 = D..ABFIL1.SignalFILToBMM.PreformLoadEnable..Carico preforme abilitato
DX07 = D..ABFIL1.SignalFILToBMM.RunModeEnable..abilitazione marcia
DX08 = D..ABFIL1.SignalFILToBMM.FillerRunning..Filler in marcia
DX09 = D..ABFIL1.SignalFILToBMM.FillerEmpty..Filler vuota
DX10 = D..ABFIL1.SignalFILToBMM.EmergencyDoorOK..Emergenze portelle OK                      
DX11 = D..ABFIL1.SignalFILToBMM.UnloadRequest..Richiesta scarico
DX12 = D..ABFIL1.SignalFILToBMM.PreformAndBottlesReject..Espulsione Preforme e bottiglie
DX13 = D..ABFIL1.SignalFILToBMM.ReSyncEnable..ReSync abilitata                       
DX14 =                   
DX15 =                                
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 = A..ABFIL1.SignalFILToBMM.InitPreformToLoad..Preforme da caricare..CNTR..K1
DX20 = A..ABFIL1.SignalFILToBMM.InitSpeed..Velocità..SPDH..K1
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


[BMM_2]
;SOFFIATRICE

SX01 = B..BLOW MOLDER (WIRE)
SX02 = 
SX03 = D..ABFIL1.SignalFILFromBMM_Wire.Reset..Reset
SX04 = D..ABFIL1.SignalFILFromBMM_Wire.StartAux..Start Aux                 
SX05 = D..ABFIL1.SignalFILFromBMM_Wire.EmergencyOK1..Emergenza OK 1
SX06 = D..ABFIL1.SignalFILFromBMM_Wire.EmergencyOK2..Emergenza OK 2
SX07 = 
SX08 = 
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER (WIRE)
DX02 = 
DX03 = D..ABFIL1.SignalFILToBMM_Wire.EmergencyOK1..Emergenza OK 1
DX04 = D..ABFIL1.SignalFILToBMM_Wire.EmergencyOK2..Emergenza OK 2
DX05 = 
DX06 = 
DX07 = 
DX08 = 
DX09 = 
DX10 =                                      
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 


;*************************************************

[BSI_1]
;SOFFIATRICE

SX01 = B..BLOWER
SX02 = 
SX03 = D..ABFIL1.SignalFILFromBSI.SynchroMode..Synchro Mode 
SX04 = D..ABFIL1.SignalFILFromBSI.AlarmReset..Alarm Reset                 
SX05 =D..ABFIL1.SignalFILFromBSI.AutoCycle..Automatic Cycle
SX06 = D..ABFIL1.SignalFILFromBSI.SynchroMachine..Synchro Machine
SX07 =D..ABFIL1.SignalFILFromBSI.NotSynchroMode..Not Synchro Mode Request
SX08 = D..ABFIL1.SignalFILFromBSI.BlowerRotation..Blower Rotation
SX09 = D..ABFIL1.SignalFILFromBSI.BlowerEmpty..Blower Empty
SX10 = D..ABFIL1.SignalFILFromBSI.BottleGood..Bottle Good
SX11 = D..ABFIL1.SignalFILFromBSI.SynchroJogReq..Synchro Jog Request
SX12 = D..ABFIL1.SignalFILFromBSI.SynchroJogEnable..Synchro Jog Enable
SX13 = D..ABFIL1.SignalFILFromBSI.EmergencyOK..Emergency OK
SX14 = D..ABFIL1.SignalFILFromBSI.DoorClose..Door Close
SX15 = D..ABFIL1.SignalFILFromBSI.ReSynchroConfirm..ReSynchro Confirm
SX16 = 
SX17 = 
SX18 = 
SX19 = A..ABFIL1.SignalFILFromBSI.PreformBottlesNumber..Preform Bottles Number..CNTR..K1
SX20 = A..ABFIL1.SignalFILFromBSI.RecipeSpeed..RecipeSpeed..SPDH..K1
SX21 = 
SX22 = 
SX23 = D..ABFIL1.SignalFILFromBSI_Wire.Reset..Reset
SX24 = D..ABFIL1.SignalFILFromBSI_Wire.StartAux..Start Aux                 
SX25 = D..ABFIL1.SignalFILFromBSI_Wire.EmergencyOK1..Emergency OK 1
SX26 = D..ABFIL1.SignalFILFromBSI_Wire.EmergencyOK2..Emergencya OK 2
SX27 = 
SX28 = 

DX01 = B..FILLER
DX02 = 
DX03 = D..ABFIL1.SignalFILToBSI.FillerReady..Filler Ready
DX04 = D..ABFIL1.SignalFILToBSI.DoorClose..Door Close
DX05 = D..ABFIL1.SignalFILToBSI.SyncDone..Sync Done
DX06 = D..ABFIL1.SignalFILToBSI.PreformLoadEnable..Preform Load Enable
DX07 = D..ABFIL1.SignalFILToBSI.RunModeEnable..Run Mode Enable
DX08 = D..ABFIL1.SignalFILToBSI.FillerRunning..Filler Running
DX09 = D..ABFIL1.SignalFILToBSI.FillerEmpty..Filler Empty
DX10 = D..ABFIL1.SignalFILToBSI.EmergencyDoorOK..Emergency Door OK                      
DX11 = D..ABFIL1.SignalFILToBSI.UnloadRequest..Unload Request
DX12 = D..ABFIL1.SignalFILToBSI.PreformAndBottlesReject..Preform And Bottles Reject
DX13 = D..ABFIL1.SignalFILToBSI.ReSyncEnable..ReSync Enable                      
DX14 =                   
DX15 =                                
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 = A..ABFIL1.SignalFILToBSI.InitPreformToLoad..Init Preform To Load..NONE..K1
DX20 = A..ABFIL1.SignalFILToBSI.InitSpeed..Init Speed..SPDH..K1
DX21 = 
DX22 = 
DX23 = D..ABFIL1.SignalFILToBSI_Wire.EmergencyOK1..Emergency OK 1
DX24 = D..ABFIL1.SignalFILToBSI_Wire.EmergencyOK2..Emergency OK 2
DX25 = 
DX26 = 
DX27 = 
DX28 = 

[BSI_2]
;SOFFIATRICE

SX01 = B..BLOW MOLDER (WIRE)
SX02 = 
SX03 = D..ABFIL1.SignalFILFromBSI_Wire.Reset..Reset
SX04 = D..ABFIL1.SignalFILFromBSI_Wire.StartAux..Start Aux                 
SX05 = D..ABFIL1.SignalFILFromBSI_Wire.EmergencyOK1..Emergency OK 1
SX06 = D..ABFIL1.SignalFILFromBSI_Wire.EmergencyOK2..Emergencya OK 2
SX07 = 
SX08 = 
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 

DX01 = B..FILLER (WIRE)
DX02 = 
DX03 = D..ABFIL1.SignalFILToBSI_Wire.EmergencyOK1..Emergency OK 1
DX04 = D..ABFIL1.SignalFILToBSI_Wire.EmergencyOK2..Emergency OK 2
DX05 = 
DX06 = 
DX07 = 
DX08 = 
DX09 = 
DX10 =                                      
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 
;*************************************************

;*************************************************

[BKH_1]
;SOFFIATRICE
SX01 = B..BLOWER
SX02 = 
SX03 = D..ABFIL1.SignalFILFromBKH.SynchroMode..Synchro Mode Enable (1 = Enable)
SX04 = D..ABFIL1.SignalFILFromBKH.AlarmReset..Alarm Reset                 
SX05 = D..ABFIL1.SignalFILFromBKH.AutoCycle..Auto Cycle
SX06 = D..ABFIL1.SignalFILFromBKH.SynchroMachine..Synchro Machine
SX07 = D..ABFIL1.SignalFILFromBKH.loading_on..Loading On
SX08 = D..ABFIL1.SignalFILFromBKH.NotSynchroMode..Not Synchro Mode
SX09 = D..ABFIL1.SignalFILFromBKH.Nominal_speed..Nominal Speed
SX10 = D..ABFIL1.SignalFILFromBKH.BlowerRotation..Blower Rotation
SX11 = D..ABFIL1.SignalFILFromBKH.BlowerEmpty..Blower Empty
SX12 = D..ABFIL1.SignalFILFromBKH.BrakeOn..Blower Brake On
SX13 = D..ABFIL1.SignalFILFromBKH.BottleGood..Bottle Good
SX14 = 
SX15 = D..ABFIL1.SignalFILFromBKH.EmergencyOK..Emergency OK
SX16 = D..ABFIL1.SignalFILFromBKH.DoorClose..Door Close
SX17 = A..ABFIL1.SignalFILFromBKH.PreformBottlesNumber..Preform + Bottles Number on Machine..NONE..K1
SX18 = A..ABFIL1.SignalFILFromBKH.RecipeSpeed..Recipe Speed..SPDH..K1
SX19 = A..ABFIL1.SignalFILFromBKH.RealSpeed..Real Speed..SPDH..K1   
SX20 = A..ABFIL1.SignalFILFromBKH.RecipeSpeedBKH..kHS Recipe Speed..SPDH..K1
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER
DX02 = 
DX03 = D..ABFIL1.SignalFILToBKH.FillerReady..Filler Ready
DX04 = D..ABFIL1.SignalFILToBKH.SyncDone..Sync Done
DX05 = D..ABFIL1.SignalFILToBKH.PreformLoadEnable..Preform Load Enable
DX06 = D..ABFIL1.SignalFILToBKH.FillerAllarm..Filler Alarm
DX07 = D..ABFIL1.SignalFILToBKH.FillerMainDriverOn..Main Filler Driver On
DX08 = D..ABFIL1.SignalFILToBKH.HoldNominalSpeed..Hold Nominal Speed  
DX09 = D..ABFIL1.SignalFILToBKH.FillerEmpty..Filler Empty                   
DX10 = D..ABFIL1.SignalFILToBKH.UnloadRequest..Unload Request
DX11 = D..ABFIL1.SignalFILToBKH.PreformAndBottlesReject..Preform And Bottles Reject                 
DX12 = D..ABFIL1.SignalFILToBKH.ReSyncEnable..ReSync Enable  
DX13 = D..ABFIL1.SignalFILToBKH.TuningEnable..Enable Tuning Procedure 0 pos. to Blower 
DX14 =                
DX15 = D..ABFIL1.SignalFILToBKH.emergency_pushbutton_ok..Filler Hand Emergency Stop OK 
DX16 = D..ABFIL1.SignalFILToBKH.Safety_Door_Closed..Door Close                                    
DX17 =                                     
DX18 =                                 
DX19 = A..ABFIL1.SignalFILToBKH.InitPreformToLoad..Init Preform To Load..NONE..K1
DX20 = A..ABFIL1.SignalFILToBKH.InitSpeed..Init Speed..SPDH..K1
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 = 



[BKH_2]
;SOFFIATRICE

SX01 = B..BLOW MOLDER (WIRE)
SX02 = 
SX03 = D..ABFIL1.SignalFILFromBKH.ManualSincronization..Manual Synchronization
SX04 = D..ABFIL1.SignalFILFromBKH.ReSynchroConfirm..ReSynchro Confirm               
SX05 = 
SX06 = D..ABFIL1.SignalFILFromBKH.HelpBitSynchroMachine..Synchro Request Start Filler (1=start)
SX07 = D..ABFIL1.SignalFILFromBKH.HelpBitNoSynchroMode..No Synchro Start Request 
SX08 = 
SX09 = 
SX10 = 
SX11 = 
SX12 = 
SX13 = 
SX14 = 
SX15 = 
SX16 = 
SX17 = 
SX18 = 
SX19 = 
SX20 = 
SX21 = 
SX22 = 
SX23 = 
SX24 = 
SX25 = 
SX26 = 
SX27 = 
SX28 = 


DX01 = B..FILLER (WIRE)
DX02 = 
DX03 = D..ABFIL1.SignalFILToBKH.TuningEnable..Enable Tuning Procedure 0 position to Blower 
DX04 = D..ABFIL1.SignalFILToBKH.ReSyncEnable..Resynchronization Enable
DX05 = 
DX06 = 
DX07 = 
DX08 = 
DX09 = 
DX10 =                                      
DX11 = 
DX12 =                                     
DX13 =                                     
DX14 =                                     
DX15 =                                     
DX16 =                                     
DX17 =                                     
DX18 =                                     
DX19 =                                     
DX20 = 
DX21 = 
DX22 = 
DX23 = 
DX24 = 
DX25 = 
DX26 = 
DX27 = 
DX28 =    



;*************************************************



























































































































